ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_DEVICE_STATUS_BK : (USB Offset: 0x0A) (R/W 8) DEVICE_DESC_BANK Enpoint Bank, Status of Bank -------- */
#define USB_DEVICE_STATUS_BK_CRCERR_Pos _UINT8_(0) /* (USB_DEVICE_STATUS_BK) CRC Error Status Position */
#define USB_DEVICE_STATUS_BK_CRCERR_Msk                                                                                \
        (_UINT8_(0x1) << USB_DEVICE_STATUS_BK_CRCERR_Pos) /* (USB_DEVICE_STATUS_BK) CRC Error Status Mask */
#define USB_DEVICE_STATUS_BK_CRCERR(value)                                                                             \
        (USB_DEVICE_STATUS_BK_CRCERR_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_STATUS_BK_CRCERR_Pos)) /* Assigment of value for CRCERR in the                  \
                                                                 USB_DEVICE_STATUS_BK register */
#define USB_DEVICE_STATUS_BK_ERRORFLOW_Pos _UINT8_(1) /* (USB_DEVICE_STATUS_BK) Error Flow Status Position */
#define USB_DEVICE_STATUS_BK_ERRORFLOW_Msk                                                                             \
        (_UINT8_(0x1) << USB_DEVICE_STATUS_BK_ERRORFLOW_Pos) /* (USB_DEVICE_STATUS_BK) Error Flow Status Mask */
#define USB_DEVICE_STATUS_BK_ERRORFLOW(value)                                                                          \
        (USB_DEVICE_STATUS_BK_ERRORFLOW_Msk &                                                                          \
         (_UINT8_(value) << USB_DEVICE_STATUS_BK_ERRORFLOW_Pos)) /* Assigment of value for ERRORFLOW in the            \
                                                                    USB_DEVICE_STATUS_BK register */
#define USB_DEVICE_STATUS_BK_Msk _UINT8_(0x03) /* (USB_DEVICE_STATUS_BK) Register Mask  */


/* -------- USB_HOST_ADDR : (USB Offset: 0x00) (R/W 32) HOST_DESC_BANK Host Bank, Adress of Data Buffer -------- */
#define USB_HOST_ADDR_ADDR_Pos _UINT32_(0) /* (USB_HOST_ADDR) Adress of data buffer Position */
#define USB_HOST_ADDR_ADDR_Msk                                                                                         \
        (_UINT32_(0xFFFFFFFF) << USB_HOST_ADDR_ADDR_Pos) /* (USB_HOST_ADDR) Adress of data buffer Mask */
#define USB_HOST_ADDR_ADDR(value)                                                                                      \
        (USB_HOST_ADDR_ADDR_Msk &                                                                                      \
         (_UINT32_(value) << USB_HOST_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the USB_HOST_ADDR register */
#define USB_HOST_ADDR_Msk _UINT32_(0xFFFFFFFF) /* (USB_HOST_ADDR) Register Mask  */


/* -------- USB_HOST_PCKSIZE : (USB Offset: 0x04) (R/W 32) HOST_DESC_BANK Host Bank, Packet Size -------- */
#define USB_HOST_PCKSIZE_BYTE_COUNT_Pos _UINT32_(0) /* (USB_HOST_PCKSIZE) Byte Count Position */
#define USB_HOST_PCKSIZE_BYTE_COUNT_Msk                                                                                \
        (_UINT32_(0x3FFF) << USB_HOST_PCKSIZE_BYTE_COUNT_Pos) /* (USB_HOST_PCKSIZE) Byte Count Mask */
#define USB_HOST_PCKSIZE_BYTE_COUNT(value)                                                                             \
        (USB_HOST_PCKSIZE_BYTE_COUNT_Msk &                                                                             \
         (_UINT32_(value) << USB_HOST_PCKSIZE_BYTE_COUNT_Pos)) /* Assigment of value for BYTE_COUNT in the             \
                                                                  USB_HOST_PCKSIZE register */
#define USB_HOST_PCKSIZE_MULTI_PACKET_SIZE_Pos                                                                         \
        _UINT32_(14) /* (USB_HOST_PCKSIZE) Multi Packet In or Out size Position */
#define USB_HOST_PCKSIZE_MULTI_PACKET_SIZE_Msk                                                                         \
        (_UINT32_(0x3FFF)                                                                                              \
         << USB_HOST_PCKSIZE_MULTI_PACKET_SIZE_Pos) /* (USB_HOST_PCKSIZE) Multi Packet In or Out size Mask */
#define USB_HOST_PCKSIZE_MULTI_PACKET_SIZE(value)                                                                      \
        (USB_HOST_PCKSIZE_MULTI_PACKET_SIZE_Msk &                                                                      \
         (_UINT32_(value) << USB_HOST_PCKSIZE_MULTI_PACKET_SIZE_Pos)) /* Assigment of value for MULTI_PACKET_SIZE in   \
                                                                         the USB_HOST_PCKSIZE register */
#define USB_HOST_PCKSIZE_SIZE_Pos _UINT32_(28) /* (USB_HOST_PCKSIZE) Pipe size Position */
#define USB_HOST_PCKSIZE_SIZE_Msk (_UINT32_(0x7) << USB_HOST_PCKSIZE_SIZE_Pos) /* (USB_HOST_PCKSIZE) Pipe size Mask */
#define USB_HOST_PCKSIZE_SIZE(value)                                                                                   \
        (USB_HOST_PCKSIZE_SIZE_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << USB_HOST_PCKSIZE_SIZE_Pos)) /* Assigment of value for SIZE in the USB_HOST_PCKSIZE register */
#define USB_HOST_PCKSIZE_AUTO_ZLP_Pos _UINT32_(31) /* (USB_HOST_PCKSIZE) Automatic Zero Length Packet Position */
#define USB_HOST_PCKSIZE_AUTO_ZLP_Msk                                                                                  \
        (_UINT32_(0x1) << USB_HOST_PCKSIZE_AUTO_ZLP_Pos) /* (USB_HOST_PCKSIZE) Automatic Zero Length Packet Mask */
#define USB_HOST_PCKSIZE_AUTO_ZLP(value)                                                                               \
        (USB_HOST_PCKSIZE_AUTO_ZLP_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << USB_HOST_PCKSIZE_AUTO_ZLP_Pos)) /* Assigment of value for AUTO_ZLP in the USB_HOST_PCKSIZE register */
#define USB_HOST_PCKSIZE_Msk _UINT32_(0xFFFFFFFF) /* (USB_HOST_PCKSIZE) Register Mask  */


