ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_HOST_EXTREG : (USB Offset: 0x08) (R/W 16) HOST_DESC_BANK Host Bank, Extended -------- */
#define USB_HOST_EXTREG_SUBPID_Pos _UINT16_(0) /* (USB_HOST_EXTREG) SUBPID field send with extended token Position */
#define USB_HOST_EXTREG_SUBPID_Msk                                                                                     \
        (_UINT16_(0xF) << USB_HOST_EXTREG_SUBPID_Pos) /* (USB_HOST_EXTREG) SUBPID field send with extended token Mask  \
                                                       */
#define USB_HOST_EXTREG_SUBPID(value)                                                                                  \
        (USB_HOST_EXTREG_SUBPID_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_EXTREG_SUBPID_Pos)) /* Assigment of value for SUBPID in the USB_HOST_EXTREG register */
#define USB_HOST_EXTREG_VARIABLE_Pos                                                                                   \
        _UINT16_(4) /* (USB_HOST_EXTREG) Variable field send with extended token Position */
#define USB_HOST_EXTREG_VARIABLE_Msk                                                                                   \
        (_UINT16_(0x7FF)                                                                                               \
         << USB_HOST_EXTREG_VARIABLE_Pos) /* (USB_HOST_EXTREG) Variable field send with extended token Mask */
#define USB_HOST_EXTREG_VARIABLE(value)                                                                                \
        (USB_HOST_EXTREG_VARIABLE_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_EXTREG_VARIABLE_Pos)) /* Assigment of value for VARIABLE in the USB_HOST_EXTREG register */
#define USB_HOST_EXTREG_Msk _UINT16_(0x7FFF) /* (USB_HOST_EXTREG) Register Mask  */


/* -------- USB_HOST_STATUS_BK : (USB Offset: 0x0A) (R/W 8) HOST_DESC_BANK Host Bank, Status of Bank -------- */
#define USB_HOST_STATUS_BK_CRCERR_Pos _UINT8_(0) /* (USB_HOST_STATUS_BK) CRC Error Status Position */
#define USB_HOST_STATUS_BK_CRCERR_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_STATUS_BK_CRCERR_Pos) /* (USB_HOST_STATUS_BK) CRC Error Status Mask */
#define USB_HOST_STATUS_BK_CRCERR(value)                                                                               \
        (USB_HOST_STATUS_BK_CRCERR_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_STATUS_BK_CRCERR_Pos)) /* Assigment of value for CRCERR in the USB_HOST_STATUS_BK register */
#define USB_HOST_STATUS_BK_ERRORFLOW_Pos _UINT8_(1) /* (USB_HOST_STATUS_BK) Error Flow Status Position */
#define USB_HOST_STATUS_BK_ERRORFLOW_Msk                                                                               \
        (_UINT8_(0x1) << USB_HOST_STATUS_BK_ERRORFLOW_Pos) /* (USB_HOST_STATUS_BK) Error Flow Status Mask */
#define USB_HOST_STATUS_BK_ERRORFLOW(value)                                                                            \
        (USB_HOST_STATUS_BK_ERRORFLOW_Msk &                                                                            \
         (_UINT8_(value) << USB_HOST_STATUS_BK_ERRORFLOW_Pos)) /* Assigment of value for ERRORFLOW in the              \
                                                                  USB_HOST_STATUS_BK register */
#define USB_HOST_STATUS_BK_Msk _UINT8_(0x03) /* (USB_HOST_STATUS_BK) Register Mask  */


/* -------- USB_HOST_CTRL_PIPE : (USB Offset: 0x0C) (R/W 16) HOST_DESC_BANK Host Bank, Host Control Pipe -------- */
#define USB_HOST_CTRL_PIPE_RESETVALUE                                                                                  \
        _UINT16_(0x00) /*  (USB_HOST_CTRL_PIPE) HOST_DESC_BANK Host Bank, Host Control Pipe  Reset Value */

#define USB_HOST_CTRL_PIPE_PDADDR_Pos _UINT16_(0) /* (USB_HOST_CTRL_PIPE) Pipe Device Adress Position */
#define USB_HOST_CTRL_PIPE_PDADDR_Msk                                                                                  \
        (_UINT16_(0x7F) << USB_HOST_CTRL_PIPE_PDADDR_Pos) /* (USB_HOST_CTRL_PIPE) Pipe Device Adress Mask */
#define USB_HOST_CTRL_PIPE_PDADDR(value)                                                                               \
        (USB_HOST_CTRL_PIPE_PDADDR_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRL_PIPE_PDADDR_Pos)) /* Assigment of value for PDADDR in the USB_HOST_CTRL_PIPE register */
#define USB_HOST_CTRL_PIPE_PEPNUM_Pos _UINT16_(8) /* (USB_HOST_CTRL_PIPE) Pipe Endpoint Number Position */
#define USB_HOST_CTRL_PIPE_PEPNUM_Msk                                                                                  \
        (_UINT16_(0xF) << USB_HOST_CTRL_PIPE_PEPNUM_Pos) /* (USB_HOST_CTRL_PIPE) Pipe Endpoint Number Mask */
#define USB_HOST_CTRL_PIPE_PEPNUM(value)                                                                               \
        (USB_HOST_CTRL_PIPE_PEPNUM_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRL_PIPE_PEPNUM_Pos)) /* Assigment of value for PEPNUM in the USB_HOST_CTRL_PIPE register */
#define USB_HOST_CTRL_PIPE_PERMAX_Pos _UINT16_(12) /* (USB_HOST_CTRL_PIPE) Pipe Error Max Number Position */
#define USB_HOST_CTRL_PIPE_PERMAX_Msk                                                                                  \
        (_UINT16_(0xF) << USB_HOST_CTRL_PIPE_PERMAX_Pos) /* (USB_HOST_CTRL_PIPE) Pipe Error Max Number Mask */
#define USB_HOST_CTRL_PIPE_PERMAX(value)                                                                               \
        (USB_HOST_CTRL_PIPE_PERMAX_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRL_PIPE_PERMAX_Pos)) /* Assigment of value for PERMAX in the USB_HOST_CTRL_PIPE register */
#define USB_HOST_CTRL_PIPE_Msk _UINT16_(0xFF7F) /* (USB_HOST_CTRL_PIPE) Register Mask  */


