ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_DEVICE_EPINTFLAG_TRCPT0_Pos _UINT8_(0) /* (USB_DEVICE_EPINTFLAG) Transfer Complete 0 Position */
#define USB_DEVICE_EPINTFLAG_TRCPT0_Msk                                                                                \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_TRCPT0_Pos) /* (USB_DEVICE_EPINTFLAG) Transfer Complete 0 Mask */
#define USB_DEVICE_EPINTFLAG_TRCPT0(value)                                                                             \
        (USB_DEVICE_EPINTFLAG_TRCPT0_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the                  \
                                                                 USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_TRCPT1_Pos _UINT8_(1) /* (USB_DEVICE_EPINTFLAG) Transfer Complete 1 Position */
#define USB_DEVICE_EPINTFLAG_TRCPT1_Msk                                                                                \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_TRCPT1_Pos) /* (USB_DEVICE_EPINTFLAG) Transfer Complete 1 Mask */
#define USB_DEVICE_EPINTFLAG_TRCPT1(value)                                                                             \
        (USB_DEVICE_EPINTFLAG_TRCPT1_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the                  \
                                                                 USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_TRFAIL0_Pos _UINT8_(2) /* (USB_DEVICE_EPINTFLAG) Error Flow 0 Position */
#define USB_DEVICE_EPINTFLAG_TRFAIL0_Msk                                                                               \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_TRFAIL0_Pos) /* (USB_DEVICE_EPINTFLAG) Error Flow 0 Mask */
#define USB_DEVICE_EPINTFLAG_TRFAIL0(value)                                                                            \
        (USB_DEVICE_EPINTFLAG_TRFAIL0_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRFAIL0_Pos)) /* Assigment of value for TRFAIL0 in the                \
                                                                  USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_TRFAIL1_Pos _UINT8_(3) /* (USB_DEVICE_EPINTFLAG) Error Flow 1 Position */
#define USB_DEVICE_EPINTFLAG_TRFAIL1_Msk                                                                               \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_TRFAIL1_Pos) /* (USB_DEVICE_EPINTFLAG) Error Flow 1 Mask */
#define USB_DEVICE_EPINTFLAG_TRFAIL1(value)                                                                            \
        (USB_DEVICE_EPINTFLAG_TRFAIL1_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRFAIL1_Pos)) /* Assigment of value for TRFAIL1 in the                \
                                                                  USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_RXSTP_Pos _UINT8_(4) /* (USB_DEVICE_EPINTFLAG) Received Setup Position */
#define USB_DEVICE_EPINTFLAG_RXSTP_Msk                                                                                 \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_RXSTP_Pos) /* (USB_DEVICE_EPINTFLAG) Received Setup Mask */
#define USB_DEVICE_EPINTFLAG_RXSTP(value)                                                                              \
        (USB_DEVICE_EPINTFLAG_RXSTP_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_DEVICE_EPINTFLAG_RXSTP_Pos)) /* Assigment of value for RXSTP in the USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_STALL0_Pos _UINT8_(5) /* (USB_DEVICE_EPINTFLAG) Stall 0 In/out Position */
#define USB_DEVICE_EPINTFLAG_STALL0_Msk                                                                                \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_STALL0_Pos) /* (USB_DEVICE_EPINTFLAG) Stall 0 In/out Mask */
#define USB_DEVICE_EPINTFLAG_STALL0(value)                                                                             \
        (USB_DEVICE_EPINTFLAG_STALL0_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_STALL0_Pos)) /* Assigment of value for STALL0 in the                  \
                                                                 USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_STALL1_Pos _UINT8_(6) /* (USB_DEVICE_EPINTFLAG) Stall 1 In/out Position */
#define USB_DEVICE_EPINTFLAG_STALL1_Msk                                                                                \
        (_UINT8_(0x1) << USB_DEVICE_EPINTFLAG_STALL1_Pos) /* (USB_DEVICE_EPINTFLAG) Stall 1 In/out Mask */
#define USB_DEVICE_EPINTFLAG_STALL1(value)                                                                             \
        (USB_DEVICE_EPINTFLAG_STALL1_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTFLAG_STALL1_Pos)) /* Assigment of value for STALL1 in the                  \
                                                                 USB_DEVICE_EPINTFLAG register */
#define USB_DEVICE_EPINTFLAG_Msk _UINT8_(0x7F) /* (USB_DEVICE_EPINTFLAG) Register Mask  */

#define USB_DEVICE_EPINTFLAG_TRCPT_Pos _UINT8_(0) /* (USB_DEVICE_EPINTFLAG Position) Transfer Complete x */
#define USB_DEVICE_EPINTFLAG_TRCPT_Msk                                                                                 \
        (_UINT8_(0x3) << USB_DEVICE_EPINTFLAG_TRCPT_Pos) /* (USB_DEVICE_EPINTFLAG Mask) TRCPT */
#define USB_DEVICE_EPINTFLAG_TRCPT(value)                                                                              \
        (USB_DEVICE_EPINTFLAG_TRCPT_Msk & (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRCPT_Pos))
#define USB_DEVICE_EPINTFLAG_TRFAIL_Pos _UINT8_(2) /* (USB_DEVICE_EPINTFLAG Position) Error Flow x */
#define USB_DEVICE_EPINTFLAG_TRFAIL_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_EPINTFLAG_TRFAIL_Pos) /* (USB_DEVICE_EPINTFLAG Mask) TRFAIL */
#define USB_DEVICE_EPINTFLAG_TRFAIL(value)                                                                             \
        (USB_DEVICE_EPINTFLAG_TRFAIL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTFLAG_TRFAIL_Pos))
#define USB_DEVICE_EPINTFLAG_STALL_Pos _UINT8_(5) /* (USB_DEVICE_EPINTFLAG Position) Stall x In/out */
#define USB_DEVICE_EPINTFLAG_STALL_Msk                                                                                 \
        (_UINT8_(0x3) << USB_DEVICE_EPINTFLAG_STALL_Pos) /* (USB_DEVICE_EPINTFLAG Mask) STALL */
#define USB_DEVICE_EPINTFLAG_STALL(value)                                                                              \
        (USB_DEVICE_EPINTFLAG_STALL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTFLAG_STALL_Pos))

/* -------- USB_DEVICE_EPINTENCLR : (USB Offset: 0x08) (R/W 8) DEVICE_ENDPOINT End Point Interrupt Clear Flag --------
 */
#define USB_DEVICE_EPINTENCLR_RESETVALUE                                                                               \
        _UINT8_(0x00) /*  (USB_DEVICE_EPINTENCLR) DEVICE_ENDPOINT End Point Interrupt Clear Flag  Reset Value */

#define USB_DEVICE_EPINTENCLR_TRCPT0_Pos                                                                               \
        _UINT8_(0) /* (USB_DEVICE_EPINTENCLR) Transfer Complete 0 Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_TRCPT0_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_TRCPT0_Pos) /* (USB_DEVICE_EPINTENCLR) Transfer Complete 0 Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_TRCPT0(value)                                                                            \
        (USB_DEVICE_EPINTENCLR_TRCPT0_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the                 \
                                                                  USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_TRCPT1_Pos                                                                               \
        _UINT8_(1) /* (USB_DEVICE_EPINTENCLR) Transfer Complete 1 Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_TRCPT1_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_TRCPT1_Pos) /* (USB_DEVICE_EPINTENCLR) Transfer Complete 1 Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_TRCPT1(value)                                                                            \
        (USB_DEVICE_EPINTENCLR_TRCPT1_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the                 \
                                                                  USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_TRFAIL0_Pos                                                                              \
        _UINT8_(2) /* (USB_DEVICE_EPINTENCLR) Error Flow 0 Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_TRFAIL0_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_TRFAIL0_Pos) /* (USB_DEVICE_EPINTENCLR) Error Flow 0 Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_TRFAIL0(value)                                                                           \
        (USB_DEVICE_EPINTENCLR_TRFAIL0_Msk &                                                                           \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRFAIL0_Pos)) /* Assigment of value for TRFAIL0 in the               \
                                                                   USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_TRFAIL1_Pos                                                                              \
        _UINT8_(3) /* (USB_DEVICE_EPINTENCLR) Error Flow 1 Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_TRFAIL1_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_TRFAIL1_Pos) /* (USB_DEVICE_EPINTENCLR) Error Flow 1 Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_TRFAIL1(value)                                                                           \
        (USB_DEVICE_EPINTENCLR_TRFAIL1_Msk &                                                                           \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRFAIL1_Pos)) /* Assigment of value for TRFAIL1 in the               \
                                                                   USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_RXSTP_Pos                                                                                \
        _UINT8_(4) /* (USB_DEVICE_EPINTENCLR) Received Setup Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_RXSTP_Msk                                                                                \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_RXSTP_Pos) /* (USB_DEVICE_EPINTENCLR) Received Setup Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_RXSTP(value)                                                                             \
        (USB_DEVICE_EPINTENCLR_RXSTP_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_RXSTP_Pos)) /* Assigment of value for RXSTP in the                   \
                                                                 USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_STALL0_Pos                                                                               \
        _UINT8_(5) /* (USB_DEVICE_EPINTENCLR) Stall 0 In/Out Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_STALL0_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_STALL0_Pos) /* (USB_DEVICE_EPINTENCLR) Stall 0 In/Out Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_STALL0(value)                                                                            \
        (USB_DEVICE_EPINTENCLR_STALL0_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_STALL0_Pos)) /* Assigment of value for STALL0 in the                 \
                                                                  USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_STALL1_Pos                                                                               \
        _UINT8_(6) /* (USB_DEVICE_EPINTENCLR) Stall 1 In/Out Interrupt Disable Position */
#define USB_DEVICE_EPINTENCLR_STALL1_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENCLR_STALL1_Pos) /* (USB_DEVICE_EPINTENCLR) Stall 1 In/Out Interrupt Disable Mask */
#define USB_DEVICE_EPINTENCLR_STALL1(value)                                                                            \
        (USB_DEVICE_EPINTENCLR_STALL1_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENCLR_STALL1_Pos)) /* Assigment of value for STALL1 in the                 \
                                                                  USB_DEVICE_EPINTENCLR register */
#define USB_DEVICE_EPINTENCLR_Msk _UINT8_(0x7F) /* (USB_DEVICE_EPINTENCLR) Register Mask  */

#define USB_DEVICE_EPINTENCLR_TRCPT_Pos                                                                                \
        _UINT8_(0) /* (USB_DEVICE_EPINTENCLR Position) Transfer Complete x Interrupt Disable */
#define USB_DEVICE_EPINTENCLR_TRCPT_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENCLR_TRCPT_Pos) /* (USB_DEVICE_EPINTENCLR Mask) TRCPT */
#define USB_DEVICE_EPINTENCLR_TRCPT(value)                                                                             \
        (USB_DEVICE_EPINTENCLR_TRCPT_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRCPT_Pos))
#define USB_DEVICE_EPINTENCLR_TRFAIL_Pos                                                                               \
        _UINT8_(2) /* (USB_DEVICE_EPINTENCLR Position) Error Flow x Interrupt Disable */
#define USB_DEVICE_EPINTENCLR_TRFAIL_Msk                                                                               \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENCLR_TRFAIL_Pos) /* (USB_DEVICE_EPINTENCLR Mask) TRFAIL */
#define USB_DEVICE_EPINTENCLR_TRFAIL(value)                                                                            \
        (USB_DEVICE_EPINTENCLR_TRFAIL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENCLR_TRFAIL_Pos))
#define USB_DEVICE_EPINTENCLR_STALL_Pos                                                                                \
        _UINT8_(5) /* (USB_DEVICE_EPINTENCLR Position) Stall x In/Out Interrupt Disable */
#define USB_DEVICE_EPINTENCLR_STALL_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENCLR_STALL_Pos) /* (USB_DEVICE_EPINTENCLR Mask) STALL */
#define USB_DEVICE_EPINTENCLR_STALL(value)                                                                             \
        (USB_DEVICE_EPINTENCLR_STALL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENCLR_STALL_Pos))

/* -------- USB_DEVICE_EPINTENSET : (USB Offset: 0x09) (R/W 8) DEVICE_ENDPOINT End Point Interrupt Set Flag -------- */
#define USB_DEVICE_EPINTENSET_RESETVALUE                                                                               \
        _UINT8_(0x00) /*  (USB_DEVICE_EPINTENSET) DEVICE_ENDPOINT End Point Interrupt Set Flag  Reset Value */

