ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_DEVICE_EPINTENSET_TRCPT0_Pos                                                                               \
        _UINT8_(0) /* (USB_DEVICE_EPINTENSET) Transfer Complete 0 Interrupt Enable Position */
#define USB_DEVICE_EPINTENSET_TRCPT0_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_TRCPT0_Pos) /* (USB_DEVICE_EPINTENSET) Transfer Complete 0 Interrupt Enable Mask */
#define USB_DEVICE_EPINTENSET_TRCPT0(value)                                                                            \
        (USB_DEVICE_EPINTENSET_TRCPT0_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the                 \
                                                                  USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_TRCPT1_Pos                                                                               \
        _UINT8_(1) /* (USB_DEVICE_EPINTENSET) Transfer Complete 1 Interrupt Enable Position */
#define USB_DEVICE_EPINTENSET_TRCPT1_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_TRCPT1_Pos) /* (USB_DEVICE_EPINTENSET) Transfer Complete 1 Interrupt Enable Mask */
#define USB_DEVICE_EPINTENSET_TRCPT1(value)                                                                            \
        (USB_DEVICE_EPINTENSET_TRCPT1_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the                 \
                                                                  USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_TRFAIL0_Pos                                                                              \
        _UINT8_(2) /* (USB_DEVICE_EPINTENSET) Error Flow 0 Interrupt Enable Position */
#define USB_DEVICE_EPINTENSET_TRFAIL0_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_TRFAIL0_Pos) /* (USB_DEVICE_EPINTENSET) Error Flow 0 Interrupt Enable Mask */
#define USB_DEVICE_EPINTENSET_TRFAIL0(value)                                                                           \
        (USB_DEVICE_EPINTENSET_TRFAIL0_Msk &                                                                           \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRFAIL0_Pos)) /* Assigment of value for TRFAIL0 in the               \
                                                                   USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_TRFAIL1_Pos                                                                              \
        _UINT8_(3) /* (USB_DEVICE_EPINTENSET) Error Flow 1 Interrupt Enable Position */
#define USB_DEVICE_EPINTENSET_TRFAIL1_Msk                                                                              \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_TRFAIL1_Pos) /* (USB_DEVICE_EPINTENSET) Error Flow 1 Interrupt Enable Mask */
#define USB_DEVICE_EPINTENSET_TRFAIL1(value)                                                                           \
        (USB_DEVICE_EPINTENSET_TRFAIL1_Msk &                                                                           \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRFAIL1_Pos)) /* Assigment of value for TRFAIL1 in the               \
                                                                   USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_RXSTP_Pos                                                                                \
        _UINT8_(4) /* (USB_DEVICE_EPINTENSET) Received Setup Interrupt Enable Position */
#define USB_DEVICE_EPINTENSET_RXSTP_Msk                                                                                \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_RXSTP_Pos) /* (USB_DEVICE_EPINTENSET) Received Setup Interrupt Enable Mask */
#define USB_DEVICE_EPINTENSET_RXSTP(value)                                                                             \
        (USB_DEVICE_EPINTENSET_RXSTP_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_RXSTP_Pos)) /* Assigment of value for RXSTP in the                   \
                                                                 USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_STALL0_Pos                                                                               \
        _UINT8_(5) /* (USB_DEVICE_EPINTENSET) Stall 0 In/out Interrupt enable Position */
#define USB_DEVICE_EPINTENSET_STALL0_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_STALL0_Pos) /* (USB_DEVICE_EPINTENSET) Stall 0 In/out Interrupt enable Mask */
#define USB_DEVICE_EPINTENSET_STALL0(value)                                                                            \
        (USB_DEVICE_EPINTENSET_STALL0_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_STALL0_Pos)) /* Assigment of value for STALL0 in the                 \
                                                                  USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_STALL1_Pos                                                                               \
        _UINT8_(6) /* (USB_DEVICE_EPINTENSET) Stall 1 In/out Interrupt enable Position */
#define USB_DEVICE_EPINTENSET_STALL1_Msk                                                                               \
        (_UINT8_(0x1)                                                                                                  \
         << USB_DEVICE_EPINTENSET_STALL1_Pos) /* (USB_DEVICE_EPINTENSET) Stall 1 In/out Interrupt enable Mask */
#define USB_DEVICE_EPINTENSET_STALL1(value)                                                                            \
        (USB_DEVICE_EPINTENSET_STALL1_Msk &                                                                            \
         (_UINT8_(value) << USB_DEVICE_EPINTENSET_STALL1_Pos)) /* Assigment of value for STALL1 in the                 \
                                                                  USB_DEVICE_EPINTENSET register */
#define USB_DEVICE_EPINTENSET_Msk _UINT8_(0x7F) /* (USB_DEVICE_EPINTENSET) Register Mask  */

#define USB_DEVICE_EPINTENSET_TRCPT_Pos                                                                                \
        _UINT8_(0) /* (USB_DEVICE_EPINTENSET Position) Transfer Complete x Interrupt Enable */
#define USB_DEVICE_EPINTENSET_TRCPT_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENSET_TRCPT_Pos) /* (USB_DEVICE_EPINTENSET Mask) TRCPT */
#define USB_DEVICE_EPINTENSET_TRCPT(value)                                                                             \
        (USB_DEVICE_EPINTENSET_TRCPT_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRCPT_Pos))
#define USB_DEVICE_EPINTENSET_TRFAIL_Pos _UINT8_(2) /* (USB_DEVICE_EPINTENSET Position) Error Flow x Interrupt Enable  \
                                                     */
#define USB_DEVICE_EPINTENSET_TRFAIL_Msk                                                                               \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENSET_TRFAIL_Pos) /* (USB_DEVICE_EPINTENSET Mask) TRFAIL */
#define USB_DEVICE_EPINTENSET_TRFAIL(value)                                                                            \
        (USB_DEVICE_EPINTENSET_TRFAIL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENSET_TRFAIL_Pos))
#define USB_DEVICE_EPINTENSET_STALL_Pos                                                                                \
        _UINT8_(5) /* (USB_DEVICE_EPINTENSET Position) Stall x In/out Interrupt enable */
#define USB_DEVICE_EPINTENSET_STALL_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_EPINTENSET_STALL_Pos) /* (USB_DEVICE_EPINTENSET Mask) STALL */
#define USB_DEVICE_EPINTENSET_STALL(value)                                                                             \
        (USB_DEVICE_EPINTENSET_STALL_Msk & (_UINT8_(value) << USB_DEVICE_EPINTENSET_STALL_Pos))

/* -------- USB_HOST_PCFG : (USB Offset: 0x00) (R/W 8) HOST_PIPE End Point Configuration -------- */
#define USB_HOST_PCFG_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_PCFG) HOST_PIPE End Point Configuration  Reset Value */

