ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_HOST_PCFG_PTOKEN_Pos _UINT8_(0) /* (USB_HOST_PCFG) Pipe Token Position */
#define USB_HOST_PCFG_PTOKEN_Msk (_UINT8_(0x3) << USB_HOST_PCFG_PTOKEN_Pos) /* (USB_HOST_PCFG) Pipe Token Mask */
#define USB_HOST_PCFG_PTOKEN(value)                                                                                    \
        (USB_HOST_PCFG_PTOKEN_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PCFG_PTOKEN_Pos)) /* Assigment of value for PTOKEN in the USB_HOST_PCFG register */
#define USB_HOST_PCFG_BK_Pos _UINT8_(2) /* (USB_HOST_PCFG) Pipe Bank Position */
#define USB_HOST_PCFG_BK_Msk (_UINT8_(0x1) << USB_HOST_PCFG_BK_Pos) /* (USB_HOST_PCFG) Pipe Bank Mask */
#define USB_HOST_PCFG_BK(value)                                                                                        \
        (USB_HOST_PCFG_BK_Msk &                                                                                        \
         (_UINT8_(value) << USB_HOST_PCFG_BK_Pos)) /* Assigment of value for BK in the USB_HOST_PCFG register */
#define USB_HOST_PCFG_PTYPE_Pos _UINT8_(3) /* (USB_HOST_PCFG) Pipe Type Position */
#define USB_HOST_PCFG_PTYPE_Msk (_UINT8_(0x7) << USB_HOST_PCFG_PTYPE_Pos) /* (USB_HOST_PCFG) Pipe Type Mask */
#define USB_HOST_PCFG_PTYPE(value)                                                                                     \
        (USB_HOST_PCFG_PTYPE_Msk &                                                                                     \
         (_UINT8_(value) << USB_HOST_PCFG_PTYPE_Pos)) /* Assigment of value for PTYPE in the USB_HOST_PCFG register */
#define USB_HOST_PCFG_Msk _UINT8_(0x3F) /* (USB_HOST_PCFG) Register Mask  */


/* -------- USB_HOST_BINTERVAL : (USB Offset: 0x03) (R/W 8) HOST_PIPE Bus Access Period of Pipe -------- */
#define USB_HOST_BINTERVAL_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (USB_HOST_BINTERVAL) HOST_PIPE Bus Access Period of Pipe  Reset Value */

#define USB_HOST_BINTERVAL_BITINTERVAL_Pos _UINT8_(0) /* (USB_HOST_BINTERVAL) Bit Interval Position */
#define USB_HOST_BINTERVAL_BITINTERVAL_Msk                                                                             \
        (_UINT8_(0xFF) << USB_HOST_BINTERVAL_BITINTERVAL_Pos) /* (USB_HOST_BINTERVAL) Bit Interval Mask */
#define USB_HOST_BINTERVAL_BITINTERVAL(value)                                                                          \
        (USB_HOST_BINTERVAL_BITINTERVAL_Msk &                                                                          \
         (_UINT8_(value) << USB_HOST_BINTERVAL_BITINTERVAL_Pos)) /* Assigment of value for BITINTERVAL in the          \
                                                                    USB_HOST_BINTERVAL register */
#define USB_HOST_BINTERVAL_Msk _UINT8_(0xFF) /* (USB_HOST_BINTERVAL) Register Mask  */


/* -------- USB_HOST_PSTATUSCLR : (USB Offset: 0x04) ( /W 8) HOST_PIPE End Point Pipe Status Clear -------- */
#define USB_HOST_PSTATUSCLR_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (USB_HOST_PSTATUSCLR) HOST_PIPE End Point Pipe Status Clear  Reset Value */

#define USB_HOST_PSTATUSCLR_DTGL_Pos _UINT8_(0) /* (USB_HOST_PSTATUSCLR) Data Toggle clear Position */
#define USB_HOST_PSTATUSCLR_DTGL_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PSTATUSCLR_DTGL_Pos) /* (USB_HOST_PSTATUSCLR) Data Toggle clear Mask */
#define USB_HOST_PSTATUSCLR_DTGL(value)                                                                                \
        (USB_HOST_PSTATUSCLR_DTGL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSCLR_DTGL_Pos)) /* Assigment of value for DTGL in the USB_HOST_PSTATUSCLR register */
#define USB_HOST_PSTATUSCLR_CURBK_Pos _UINT8_(2) /* (USB_HOST_PSTATUSCLR) Curren Bank clear Position */
#define USB_HOST_PSTATUSCLR_CURBK_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PSTATUSCLR_CURBK_Pos) /* (USB_HOST_PSTATUSCLR) Curren Bank clear Mask */
#define USB_HOST_PSTATUSCLR_CURBK(value)                                                                               \
        (USB_HOST_PSTATUSCLR_CURBK_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSCLR_CURBK_Pos)) /* Assigment of value for CURBK in the USB_HOST_PSTATUSCLR register */
#define USB_HOST_PSTATUSCLR_PFREEZE_Pos _UINT8_(4) /* (USB_HOST_PSTATUSCLR) Pipe Freeze Clear Position */
#define USB_HOST_PSTATUSCLR_PFREEZE_Msk                                                                                \
        (_UINT8_(0x1) << USB_HOST_PSTATUSCLR_PFREEZE_Pos) /* (USB_HOST_PSTATUSCLR) Pipe Freeze Clear Mask */
#define USB_HOST_PSTATUSCLR_PFREEZE(value)                                                                             \
        (USB_HOST_PSTATUSCLR_PFREEZE_Msk &                                                                             \
         (_UINT8_(value) << USB_HOST_PSTATUSCLR_PFREEZE_Pos)) /* Assigment of value for PFREEZE in the                 \
                                                                 USB_HOST_PSTATUSCLR register */
#define USB_HOST_PSTATUSCLR_BK0RDY_Pos _UINT8_(6) /* (USB_HOST_PSTATUSCLR) Bank 0 Ready Clear Position */
#define USB_HOST_PSTATUSCLR_BK0RDY_Msk                                                                                 \
        (_UINT8_(0x1) << USB_HOST_PSTATUSCLR_BK0RDY_Pos) /* (USB_HOST_PSTATUSCLR) Bank 0 Ready Clear Mask */
#define USB_HOST_PSTATUSCLR_BK0RDY(value)                                                                              \
        (USB_HOST_PSTATUSCLR_BK0RDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSCLR_BK0RDY_Pos)) /* Assigment of value for BK0RDY in the USB_HOST_PSTATUSCLR register */
#define USB_HOST_PSTATUSCLR_BK1RDY_Pos _UINT8_(7) /* (USB_HOST_PSTATUSCLR) Bank 1 Ready Clear Position */
#define USB_HOST_PSTATUSCLR_BK1RDY_Msk                                                                                 \
        (_UINT8_(0x1) << USB_HOST_PSTATUSCLR_BK1RDY_Pos) /* (USB_HOST_PSTATUSCLR) Bank 1 Ready Clear Mask */
#define USB_HOST_PSTATUSCLR_BK1RDY(value)                                                                              \
        (USB_HOST_PSTATUSCLR_BK1RDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSCLR_BK1RDY_Pos)) /* Assigment of value for BK1RDY in the USB_HOST_PSTATUSCLR register */
#define USB_HOST_PSTATUSCLR_Msk _UINT8_(0xD5) /* (USB_HOST_PSTATUSCLR) Register Mask  */


