ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_HOST_PSTATUSSET : (USB Offset: 0x05) ( /W 8) HOST_PIPE End Point Pipe Status Set -------- */
#define USB_HOST_PSTATUSSET_RESETVALUE                                                                                 \
        _UINT8_(0x00) /*  (USB_HOST_PSTATUSSET) HOST_PIPE End Point Pipe Status Set  Reset Value */

#define USB_HOST_PSTATUSSET_DTGL_Pos _UINT8_(0) /* (USB_HOST_PSTATUSSET) Data Toggle Set Position */
#define USB_HOST_PSTATUSSET_DTGL_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PSTATUSSET_DTGL_Pos) /* (USB_HOST_PSTATUSSET) Data Toggle Set Mask */
#define USB_HOST_PSTATUSSET_DTGL(value)                                                                                \
        (USB_HOST_PSTATUSSET_DTGL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSSET_DTGL_Pos)) /* Assigment of value for DTGL in the USB_HOST_PSTATUSSET register */
#define USB_HOST_PSTATUSSET_CURBK_Pos _UINT8_(2) /* (USB_HOST_PSTATUSSET) Current Bank Set Position */
#define USB_HOST_PSTATUSSET_CURBK_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PSTATUSSET_CURBK_Pos) /* (USB_HOST_PSTATUSSET) Current Bank Set Mask */
#define USB_HOST_PSTATUSSET_CURBK(value)                                                                               \
        (USB_HOST_PSTATUSSET_CURBK_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSSET_CURBK_Pos)) /* Assigment of value for CURBK in the USB_HOST_PSTATUSSET register */
#define USB_HOST_PSTATUSSET_PFREEZE_Pos _UINT8_(4) /* (USB_HOST_PSTATUSSET) Pipe Freeze Set Position */
#define USB_HOST_PSTATUSSET_PFREEZE_Msk                                                                                \
        (_UINT8_(0x1) << USB_HOST_PSTATUSSET_PFREEZE_Pos) /* (USB_HOST_PSTATUSSET) Pipe Freeze Set Mask */
#define USB_HOST_PSTATUSSET_PFREEZE(value)                                                                             \
        (USB_HOST_PSTATUSSET_PFREEZE_Msk &                                                                             \
         (_UINT8_(value) << USB_HOST_PSTATUSSET_PFREEZE_Pos)) /* Assigment of value for PFREEZE in the                 \
                                                                 USB_HOST_PSTATUSSET register */
#define USB_HOST_PSTATUSSET_BK0RDY_Pos _UINT8_(6) /* (USB_HOST_PSTATUSSET) Bank 0 Ready Set Position */
#define USB_HOST_PSTATUSSET_BK0RDY_Msk                                                                                 \
        (_UINT8_(0x1) << USB_HOST_PSTATUSSET_BK0RDY_Pos) /* (USB_HOST_PSTATUSSET) Bank 0 Ready Set Mask */
#define USB_HOST_PSTATUSSET_BK0RDY(value)                                                                              \
        (USB_HOST_PSTATUSSET_BK0RDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSSET_BK0RDY_Pos)) /* Assigment of value for BK0RDY in the USB_HOST_PSTATUSSET register */
#define USB_HOST_PSTATUSSET_BK1RDY_Pos _UINT8_(7) /* (USB_HOST_PSTATUSSET) Bank 1 Ready Set Position */
#define USB_HOST_PSTATUSSET_BK1RDY_Msk                                                                                 \
        (_UINT8_(0x1) << USB_HOST_PSTATUSSET_BK1RDY_Pos) /* (USB_HOST_PSTATUSSET) Bank 1 Ready Set Mask */
#define USB_HOST_PSTATUSSET_BK1RDY(value)                                                                              \
        (USB_HOST_PSTATUSSET_BK1RDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUSSET_BK1RDY_Pos)) /* Assigment of value for BK1RDY in the USB_HOST_PSTATUSSET register */
#define USB_HOST_PSTATUSSET_Msk _UINT8_(0xD5) /* (USB_HOST_PSTATUSSET) Register Mask  */


/* -------- USB_HOST_PSTATUS : (USB Offset: 0x06) ( R/ 8) HOST_PIPE End Point Pipe Status -------- */
#define USB_HOST_PSTATUS_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_PSTATUS) HOST_PIPE End Point Pipe Status  Reset Value  \
                                                   */

#define USB_HOST_PSTATUS_DTGL_Pos _UINT8_(0) /* (USB_HOST_PSTATUS) Data Toggle Position */
#define USB_HOST_PSTATUS_DTGL_Msk (_UINT8_(0x1) << USB_HOST_PSTATUS_DTGL_Pos) /* (USB_HOST_PSTATUS) Data Toggle Mask   \
                                                                               */
#define USB_HOST_PSTATUS_DTGL(value)                                                                                   \
        (USB_HOST_PSTATUS_DTGL_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUS_DTGL_Pos)) /* Assigment of value for DTGL in the USB_HOST_PSTATUS register */
#define USB_HOST_PSTATUS_CURBK_Pos _UINT8_(2) /* (USB_HOST_PSTATUS) Current Bank Position */
#define USB_HOST_PSTATUS_CURBK_Msk                                                                                     \
        (_UINT8_(0x1) << USB_HOST_PSTATUS_CURBK_Pos) /* (USB_HOST_PSTATUS) Current Bank Mask */
#define USB_HOST_PSTATUS_CURBK(value)                                                                                  \
        (USB_HOST_PSTATUS_CURBK_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUS_CURBK_Pos)) /* Assigment of value for CURBK in the USB_HOST_PSTATUS register */
#define USB_HOST_PSTATUS_PFREEZE_Pos _UINT8_(4) /* (USB_HOST_PSTATUS) Pipe Freeze Position */
#define USB_HOST_PSTATUS_PFREEZE_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PSTATUS_PFREEZE_Pos) /* (USB_HOST_PSTATUS) Pipe Freeze Mask */
#define USB_HOST_PSTATUS_PFREEZE(value)                                                                                \
        (USB_HOST_PSTATUS_PFREEZE_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUS_PFREEZE_Pos)) /* Assigment of value for PFREEZE in the USB_HOST_PSTATUS register */
#define USB_HOST_PSTATUS_BK0RDY_Pos _UINT8_(6) /* (USB_HOST_PSTATUS) Bank 0 ready Position */
#define USB_HOST_PSTATUS_BK0RDY_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PSTATUS_BK0RDY_Pos) /* (USB_HOST_PSTATUS) Bank 0 ready Mask */
#define USB_HOST_PSTATUS_BK0RDY(value)                                                                                 \
        (USB_HOST_PSTATUS_BK0RDY_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUS_BK0RDY_Pos)) /* Assigment of value for BK0RDY in the USB_HOST_PSTATUS register */
#define USB_HOST_PSTATUS_BK1RDY_Pos _UINT8_(7) /* (USB_HOST_PSTATUS) Bank 1 ready Position */
#define USB_HOST_PSTATUS_BK1RDY_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PSTATUS_BK1RDY_Pos) /* (USB_HOST_PSTATUS) Bank 1 ready Mask */
#define USB_HOST_PSTATUS_BK1RDY(value)                                                                                 \
        (USB_HOST_PSTATUS_BK1RDY_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PSTATUS_BK1RDY_Pos)) /* Assigment of value for BK1RDY in the USB_HOST_PSTATUS register */
#define USB_HOST_PSTATUS_Msk _UINT8_(0xD5) /* (USB_HOST_PSTATUS) Register Mask  */


/* -------- USB_HOST_PINTFLAG : (USB Offset: 0x07) (R/W 8) HOST_PIPE Pipe Interrupt Flag -------- */
#define USB_HOST_PINTFLAG_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_PINTFLAG) HOST_PIPE Pipe Interrupt Flag  Reset Value  \
                                                    */

#define USB_HOST_PINTFLAG_TRCPT0_Pos _UINT8_(0) /* (USB_HOST_PINTFLAG) Transfer Complete 0 Interrupt Flag Position */
#define USB_HOST_PINTFLAG_TRCPT0_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_TRCPT0_Pos) /* (USB_HOST_PINTFLAG) Transfer Complete 0 Interrupt Flag Mask  \
                                                        */
#define USB_HOST_PINTFLAG_TRCPT0(value)                                                                                \
        (USB_HOST_PINTFLAG_TRCPT0_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_TRCPT1_Pos _UINT8_(1) /* (USB_HOST_PINTFLAG) Transfer Complete 1 Interrupt Flag Position */
#define USB_HOST_PINTFLAG_TRCPT1_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_TRCPT1_Pos) /* (USB_HOST_PINTFLAG) Transfer Complete 1 Interrupt Flag Mask  \
                                                        */
#define USB_HOST_PINTFLAG_TRCPT1(value)                                                                                \
        (USB_HOST_PINTFLAG_TRCPT1_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_TRFAIL_Pos _UINT8_(2) /* (USB_HOST_PINTFLAG) Error Flow Interrupt Flag Position */
#define USB_HOST_PINTFLAG_TRFAIL_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_TRFAIL_Pos) /* (USB_HOST_PINTFLAG) Error Flow Interrupt Flag Mask */
#define USB_HOST_PINTFLAG_TRFAIL(value)                                                                                \
        (USB_HOST_PINTFLAG_TRFAIL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_TRFAIL_Pos)) /* Assigment of value for TRFAIL in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_PERR_Pos _UINT8_(3) /* (USB_HOST_PINTFLAG) Pipe Error Interrupt Flag Position */
#define USB_HOST_PINTFLAG_PERR_Msk                                                                                     \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_PERR_Pos) /* (USB_HOST_PINTFLAG) Pipe Error Interrupt Flag Mask */
#define USB_HOST_PINTFLAG_PERR(value)                                                                                  \
        (USB_HOST_PINTFLAG_PERR_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_PERR_Pos)) /* Assigment of value for PERR in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_TXSTP_Pos _UINT8_(4) /* (USB_HOST_PINTFLAG) Transmit  Setup Interrupt Flag Position */
#define USB_HOST_PINTFLAG_TXSTP_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_TXSTP_Pos) /* (USB_HOST_PINTFLAG) Transmit  Setup Interrupt Flag Mask */
#define USB_HOST_PINTFLAG_TXSTP(value)                                                                                 \
        (USB_HOST_PINTFLAG_TXSTP_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_TXSTP_Pos)) /* Assigment of value for TXSTP in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_STALL_Pos _UINT8_(5) /* (USB_HOST_PINTFLAG) Stall Interrupt Flag Position */
#define USB_HOST_PINTFLAG_STALL_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PINTFLAG_STALL_Pos) /* (USB_HOST_PINTFLAG) Stall Interrupt Flag Mask */
#define USB_HOST_PINTFLAG_STALL(value)                                                                                 \
        (USB_HOST_PINTFLAG_STALL_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTFLAG_STALL_Pos)) /* Assigment of value for STALL in the USB_HOST_PINTFLAG register */
#define USB_HOST_PINTFLAG_Msk _UINT8_(0x3F) /* (USB_HOST_PINTFLAG) Register Mask  */

#define USB_HOST_PINTFLAG_TRCPT_Pos _UINT8_(0) /* (USB_HOST_PINTFLAG Position) Transfer Complete x Interrupt Flag */
#define USB_HOST_PINTFLAG_TRCPT_Msk (_UINT8_(0x3) << USB_HOST_PINTFLAG_TRCPT_Pos) /* (USB_HOST_PINTFLAG Mask) TRCPT */
#define USB_HOST_PINTFLAG_TRCPT(value) (USB_HOST_PINTFLAG_TRCPT_Msk & (_UINT8_(value) << USB_HOST_PINTFLAG_TRCPT_Pos))

/* -------- USB_HOST_PINTENCLR : (USB Offset: 0x08) (R/W 8) HOST_PIPE Pipe Interrupt Flag Clear -------- */
#define USB_HOST_PINTENCLR_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (USB_HOST_PINTENCLR) HOST_PIPE Pipe Interrupt Flag Clear  Reset Value */

#define USB_HOST_PINTENCLR_TRCPT0_Pos _UINT8_(0) /* (USB_HOST_PINTENCLR) Transfer Complete 0 Disable Position */
#define USB_HOST_PINTENCLR_TRCPT0_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_TRCPT0_Pos) /* (USB_HOST_PINTENCLR) Transfer Complete 0 Disable Mask */
#define USB_HOST_PINTENCLR_TRCPT0(value)                                                                               \
        (USB_HOST_PINTENCLR_TRCPT0_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_TRCPT1_Pos _UINT8_(1) /* (USB_HOST_PINTENCLR) Transfer Complete 1 Disable Position */
#define USB_HOST_PINTENCLR_TRCPT1_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_TRCPT1_Pos) /* (USB_HOST_PINTENCLR) Transfer Complete 1 Disable Mask */
#define USB_HOST_PINTENCLR_TRCPT1(value)                                                                               \
        (USB_HOST_PINTENCLR_TRCPT1_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_TRFAIL_Pos _UINT8_(2) /* (USB_HOST_PINTENCLR) Error Flow Interrupt Disable Position */
#define USB_HOST_PINTENCLR_TRFAIL_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_TRFAIL_Pos) /* (USB_HOST_PINTENCLR) Error Flow Interrupt Disable Mask */
#define USB_HOST_PINTENCLR_TRFAIL(value)                                                                               \
        (USB_HOST_PINTENCLR_TRFAIL_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_TRFAIL_Pos)) /* Assigment of value for TRFAIL in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_PERR_Pos _UINT8_(3) /* (USB_HOST_PINTENCLR) Pipe Error Interrupt Disable Position */
#define USB_HOST_PINTENCLR_PERR_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_PERR_Pos) /* (USB_HOST_PINTENCLR) Pipe Error Interrupt Disable Mask */
#define USB_HOST_PINTENCLR_PERR(value)                                                                                 \
        (USB_HOST_PINTENCLR_PERR_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_PERR_Pos)) /* Assigment of value for PERR in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_TXSTP_Pos _UINT8_(4) /* (USB_HOST_PINTENCLR) Transmit  Setup Interrupt Disable Position */
#define USB_HOST_PINTENCLR_TXSTP_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_TXSTP_Pos) /* (USB_HOST_PINTENCLR) Transmit  Setup Interrupt Disable Mask  \
                                                        */
#define USB_HOST_PINTENCLR_TXSTP(value)                                                                                \
        (USB_HOST_PINTENCLR_TXSTP_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_TXSTP_Pos)) /* Assigment of value for TXSTP in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_STALL_Pos _UINT8_(5) /* (USB_HOST_PINTENCLR) Stall Inetrrupt Disable Position */
#define USB_HOST_PINTENCLR_STALL_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTENCLR_STALL_Pos) /* (USB_HOST_PINTENCLR) Stall Inetrrupt Disable Mask */
#define USB_HOST_PINTENCLR_STALL(value)                                                                                \
        (USB_HOST_PINTENCLR_STALL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENCLR_STALL_Pos)) /* Assigment of value for STALL in the USB_HOST_PINTENCLR register */
#define USB_HOST_PINTENCLR_Msk _UINT8_(0x3F) /* (USB_HOST_PINTENCLR) Register Mask  */

