ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_HOST_PINTENCLR_TRCPT_Pos _UINT8_(0) /* (USB_HOST_PINTENCLR Position) Transfer Complete x Disable */
#define USB_HOST_PINTENCLR_TRCPT_Msk                                                                                   \
        (_UINT8_(0x3) << USB_HOST_PINTENCLR_TRCPT_Pos) /* (USB_HOST_PINTENCLR Mask) TRCPT */
#define USB_HOST_PINTENCLR_TRCPT(value)                                                                                \
        (USB_HOST_PINTENCLR_TRCPT_Msk & (_UINT8_(value) << USB_HOST_PINTENCLR_TRCPT_Pos))

/* -------- USB_HOST_PINTENSET : (USB Offset: 0x09) (R/W 8) HOST_PIPE Pipe Interrupt Flag Set -------- */
#define USB_HOST_PINTENSET_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (USB_HOST_PINTENSET) HOST_PIPE Pipe Interrupt Flag Set  Reset Value */

#define USB_HOST_PINTENSET_TRCPT0_Pos                                                                                  \
        _UINT8_(0) /* (USB_HOST_PINTENSET) Transfer Complete 0 Interrupt Enable Position */
#define USB_HOST_PINTENSET_TRCPT0_Msk                                                                                  \
        (_UINT8_(0x1)                                                                                                  \
         << USB_HOST_PINTENSET_TRCPT0_Pos) /* (USB_HOST_PINTENSET) Transfer Complete 0 Interrupt Enable Mask */
#define USB_HOST_PINTENSET_TRCPT0(value)                                                                               \
        (USB_HOST_PINTENSET_TRCPT0_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_TRCPT0_Pos)) /* Assigment of value for TRCPT0 in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_TRCPT1_Pos                                                                                  \
        _UINT8_(1) /* (USB_HOST_PINTENSET) Transfer Complete 1 Interrupt Enable Position */
#define USB_HOST_PINTENSET_TRCPT1_Msk                                                                                  \
        (_UINT8_(0x1)                                                                                                  \
         << USB_HOST_PINTENSET_TRCPT1_Pos) /* (USB_HOST_PINTENSET) Transfer Complete 1 Interrupt Enable Mask */
#define USB_HOST_PINTENSET_TRCPT1(value)                                                                               \
        (USB_HOST_PINTENSET_TRCPT1_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_TRCPT1_Pos)) /* Assigment of value for TRCPT1 in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_TRFAIL_Pos _UINT8_(2) /* (USB_HOST_PINTENSET) Error Flow Interrupt Enable Position */
#define USB_HOST_PINTENSET_TRFAIL_Msk                                                                                  \
        (_UINT8_(0x1) << USB_HOST_PINTENSET_TRFAIL_Pos) /* (USB_HOST_PINTENSET) Error Flow Interrupt Enable Mask */
#define USB_HOST_PINTENSET_TRFAIL(value)                                                                               \
        (USB_HOST_PINTENSET_TRFAIL_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_TRFAIL_Pos)) /* Assigment of value for TRFAIL in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_PERR_Pos _UINT8_(3) /* (USB_HOST_PINTENSET) Pipe Error Interrupt Enable Position */
#define USB_HOST_PINTENSET_PERR_Msk                                                                                    \
        (_UINT8_(0x1) << USB_HOST_PINTENSET_PERR_Pos) /* (USB_HOST_PINTENSET) Pipe Error Interrupt Enable Mask */
#define USB_HOST_PINTENSET_PERR(value)                                                                                 \
        (USB_HOST_PINTENSET_PERR_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_PERR_Pos)) /* Assigment of value for PERR in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_TXSTP_Pos _UINT8_(4) /* (USB_HOST_PINTENSET) Transmit  Setup Interrupt Enable Position */
#define USB_HOST_PINTENSET_TXSTP_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTENSET_TXSTP_Pos) /* (USB_HOST_PINTENSET) Transmit  Setup Interrupt Enable Mask   \
                                                        */
#define USB_HOST_PINTENSET_TXSTP(value)                                                                                \
        (USB_HOST_PINTENSET_TXSTP_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_TXSTP_Pos)) /* Assigment of value for TXSTP in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_STALL_Pos _UINT8_(5) /* (USB_HOST_PINTENSET) Stall Interrupt Enable Position */
#define USB_HOST_PINTENSET_STALL_Msk                                                                                   \
        (_UINT8_(0x1) << USB_HOST_PINTENSET_STALL_Pos) /* (USB_HOST_PINTENSET) Stall Interrupt Enable Mask */
#define USB_HOST_PINTENSET_STALL(value)                                                                                \
        (USB_HOST_PINTENSET_STALL_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_PINTENSET_STALL_Pos)) /* Assigment of value for STALL in the USB_HOST_PINTENSET register */
#define USB_HOST_PINTENSET_Msk _UINT8_(0x3F) /* (USB_HOST_PINTENSET) Register Mask  */

