ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_HOST_PINTENSET_TRCPT_Pos _UINT8_(0) /* (USB_HOST_PINTENSET Position) Transfer Complete x Interrupt Enable  \
                                                 */
#define USB_HOST_PINTENSET_TRCPT_Msk                                                                                   \
        (_UINT8_(0x3) << USB_HOST_PINTENSET_TRCPT_Pos) /* (USB_HOST_PINTENSET Mask) TRCPT */
#define USB_HOST_PINTENSET_TRCPT(value)                                                                                \
        (USB_HOST_PINTENSET_TRCPT_Msk & (_UINT8_(value) << USB_HOST_PINTENSET_TRCPT_Pos))

/* -------- USB_CTRLA : (USB Offset: 0x00) (R/W 8) Control A -------- */
#define USB_CTRLA_RESETVALUE _UINT8_(0x00) /*  (USB_CTRLA) Control A  Reset Value */

#define USB_CTRLA_SWRST_Pos _UINT8_(0) /* (USB_CTRLA) Software Reset Position */
#define USB_CTRLA_SWRST_Msk (_UINT8_(0x1) << USB_CTRLA_SWRST_Pos) /* (USB_CTRLA) Software Reset Mask */
#define USB_CTRLA_SWRST(value)                                                                                         \
        (USB_CTRLA_SWRST_Msk &                                                                                         \
         (_UINT8_(value) << USB_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the USB_CTRLA register */
#define USB_CTRLA_ENABLE_Pos _UINT8_(1) /* (USB_CTRLA) Enable Position */
#define USB_CTRLA_ENABLE_Msk (_UINT8_(0x1) << USB_CTRLA_ENABLE_Pos) /* (USB_CTRLA) Enable Mask */
#define USB_CTRLA_ENABLE(value)                                                                                        \
        (USB_CTRLA_ENABLE_Msk &                                                                                        \
         (_UINT8_(value) << USB_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the USB_CTRLA register */
#define USB_CTRLA_RUNSTDBY_Pos _UINT8_(2) /* (USB_CTRLA) Run in Standby Mode Position */
#define USB_CTRLA_RUNSTDBY_Msk (_UINT8_(0x1) << USB_CTRLA_RUNSTDBY_Pos) /* (USB_CTRLA) Run in Standby Mode Mask */
#define USB_CTRLA_RUNSTDBY(value)                                                                                      \
        (USB_CTRLA_RUNSTDBY_Msk &                                                                                      \
         (_UINT8_(value) << USB_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the USB_CTRLA register */
#define USB_CTRLA_MODE_Pos _UINT8_(7) /* (USB_CTRLA) Operating Mode Position */
#define USB_CTRLA_MODE_Msk (_UINT8_(0x1) << USB_CTRLA_MODE_Pos) /* (USB_CTRLA) Operating Mode Mask */
#define USB_CTRLA_MODE(value)                                                                                          \
        (USB_CTRLA_MODE_Msk &                                                                                          \
         (_UINT8_(value) << USB_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the USB_CTRLA register */
#define USB_CTRLA_MODE_DEVICE_Val _UINT8_(0x0) /* (USB_CTRLA) Device Mode  */
#define USB_CTRLA_MODE_HOST_Val _UINT8_(0x1) /* (USB_CTRLA) Host Mode  */
#define USB_CTRLA_MODE_DEVICE (USB_CTRLA_MODE_DEVICE_Val << USB_CTRLA_MODE_Pos) /* (USB_CTRLA) Device Mode Position */
#define USB_CTRLA_MODE_HOST (USB_CTRLA_MODE_HOST_Val << USB_CTRLA_MODE_Pos) /* (USB_CTRLA) Host Mode Position  */
#define USB_CTRLA_Msk _UINT8_(0x87) /* (USB_CTRLA) Register Mask  */


/* -------- USB_SYNCBUSY : (USB Offset: 0x02) ( R/ 8) Synchronization Busy -------- */
#define USB_SYNCBUSY_RESETVALUE _UINT8_(0x00) /*  (USB_SYNCBUSY) Synchronization Busy  Reset Value */

#define USB_SYNCBUSY_SWRST_Pos _UINT8_(0) /* (USB_SYNCBUSY) Software Reset Synchronization Busy Position */
#define USB_SYNCBUSY_SWRST_Msk                                                                                         \
        (_UINT8_(0x1) << USB_SYNCBUSY_SWRST_Pos) /* (USB_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define USB_SYNCBUSY_SWRST(value)                                                                                      \
        (USB_SYNCBUSY_SWRST_Msk &                                                                                      \
         (_UINT8_(value) << USB_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the USB_SYNCBUSY register */
#define USB_SYNCBUSY_ENABLE_Pos _UINT8_(1) /* (USB_SYNCBUSY) Enable Synchronization Busy Position */
#define USB_SYNCBUSY_ENABLE_Msk                                                                                        \
        (_UINT8_(0x1) << USB_SYNCBUSY_ENABLE_Pos) /* (USB_SYNCBUSY) Enable Synchronization Busy Mask */
#define USB_SYNCBUSY_ENABLE(value)                                                                                     \
        (USB_SYNCBUSY_ENABLE_Msk &                                                                                     \
         (_UINT8_(value) << USB_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the USB_SYNCBUSY register */
#define USB_SYNCBUSY_Msk _UINT8_(0x03) /* (USB_SYNCBUSY) Register Mask  */


/* -------- USB_QOSCTRL : (USB Offset: 0x03) (R/W 8) USB Quality Of Service -------- */
#define USB_QOSCTRL_RESETVALUE _UINT8_(0x05) /*  (USB_QOSCTRL) USB Quality Of Service  Reset Value */

#define USB_QOSCTRL_CQOS_Pos _UINT8_(0) /* (USB_QOSCTRL) Configuration Quality of Service Position */
#define USB_QOSCTRL_CQOS_Msk                                                                                           \
        (_UINT8_(0x3) << USB_QOSCTRL_CQOS_Pos) /* (USB_QOSCTRL) Configuration Quality of Service Mask */
#define USB_QOSCTRL_CQOS(value)                                                                                        \
        (USB_QOSCTRL_CQOS_Msk &                                                                                        \
         (_UINT8_(value) << USB_QOSCTRL_CQOS_Pos)) /* Assigment of value for CQOS in the USB_QOSCTRL register */
#define USB_QOSCTRL_CQOS_DISABLE_Val _UINT8_(0x0) /* (USB_QOSCTRL) Background (no sensitive operation)  */
#define USB_QOSCTRL_CQOS_LOW_Val _UINT8_(0x1) /* (USB_QOSCTRL) Sensitive Bandwidth  */
#define USB_QOSCTRL_CQOS_MEDIUM_Val _UINT8_(0x2) /* (USB_QOSCTRL) Sensitive Latency  */
#define USB_QOSCTRL_CQOS_HIGH_Val _UINT8_(0x3) /* (USB_QOSCTRL) Critical Latency  */
#define USB_QOSCTRL_CQOS_DISABLE                                                                                       \
        (                                                                                                              \
                USB_QOSCTRL_CQOS_DISABLE_Val                                                                           \
                << USB_QOSCTRL_CQOS_Pos) /* (USB_QOSCTRL) Background (no sensitive operation) Position  */
#define USB_QOSCTRL_CQOS_LOW                                                                                           \
        (USB_QOSCTRL_CQOS_LOW_Val << USB_QOSCTRL_CQOS_Pos) /* (USB_QOSCTRL) Sensitive Bandwidth Position  */
#define USB_QOSCTRL_CQOS_MEDIUM                                                                                        \
        (USB_QOSCTRL_CQOS_MEDIUM_Val << USB_QOSCTRL_CQOS_Pos) /* (USB_QOSCTRL) Sensitive Latency Position  */
#define USB_QOSCTRL_CQOS_HIGH                                                                                          \
        (USB_QOSCTRL_CQOS_HIGH_Val << USB_QOSCTRL_CQOS_Pos) /* (USB_QOSCTRL) Critical Latency Position  */
#define USB_QOSCTRL_DQOS_Pos _UINT8_(2) /* (USB_QOSCTRL) Data Quality of Service Position */
#define USB_QOSCTRL_DQOS_Msk (_UINT8_(0x3) << USB_QOSCTRL_DQOS_Pos) /* (USB_QOSCTRL) Data Quality of Service Mask */
#define USB_QOSCTRL_DQOS(value)                                                                                        \
        (USB_QOSCTRL_DQOS_Msk &                                                                                        \
         (_UINT8_(value) << USB_QOSCTRL_DQOS_Pos)) /* Assigment of value for DQOS in the USB_QOSCTRL register */
#define USB_QOSCTRL_DQOS_DISABLE_Val _UINT8_(0x0) /* (USB_QOSCTRL) Background (no sensitive operation)  */
#define USB_QOSCTRL_DQOS_LOW_Val _UINT8_(0x1) /* (USB_QOSCTRL) Sensitive Bandwidth  */
#define USB_QOSCTRL_DQOS_MEDIUM_Val _UINT8_(0x2) /* (USB_QOSCTRL) Sensitive Latency  */
#define USB_QOSCTRL_DQOS_HIGH_Val _UINT8_(0x3) /* (USB_QOSCTRL) Critical Latency  */
#define USB_QOSCTRL_DQOS_DISABLE                                                                                       \
        (                                                                                                              \
                USB_QOSCTRL_DQOS_DISABLE_Val                                                                           \
                << USB_QOSCTRL_DQOS_Pos) /* (USB_QOSCTRL) Background (no sensitive operation) Position  */
#define USB_QOSCTRL_DQOS_LOW                                                                                           \
        (USB_QOSCTRL_DQOS_LOW_Val << USB_QOSCTRL_DQOS_Pos) /* (USB_QOSCTRL) Sensitive Bandwidth Position  */
#define USB_QOSCTRL_DQOS_MEDIUM                                                                                        \
        (USB_QOSCTRL_DQOS_MEDIUM_Val << USB_QOSCTRL_DQOS_Pos) /* (USB_QOSCTRL) Sensitive Latency Position  */
#define USB_QOSCTRL_DQOS_HIGH                                                                                          \
        (USB_QOSCTRL_DQOS_HIGH_Val << USB_QOSCTRL_DQOS_Pos) /* (USB_QOSCTRL) Critical Latency Position  */
#define USB_QOSCTRL_Msk _UINT8_(0x0F) /* (USB_QOSCTRL) Register Mask  */


