ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_DEVICE_CTRLB : (USB Offset: 0x08) (R/W 16) DEVICE Control B -------- */
#define USB_DEVICE_CTRLB_RESETVALUE _UINT16_(0x01) /*  (USB_DEVICE_CTRLB) DEVICE Control B  Reset Value */

#define USB_DEVICE_CTRLB_DETACH_Pos _UINT16_(0) /* (USB_DEVICE_CTRLB) Detach Position */
#define USB_DEVICE_CTRLB_DETACH_Msk (_UINT16_(0x1) << USB_DEVICE_CTRLB_DETACH_Pos) /* (USB_DEVICE_CTRLB) Detach Mask   \
                                                                                    */
#define USB_DEVICE_CTRLB_DETACH(value)                                                                                 \
        (USB_DEVICE_CTRLB_DETACH_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_DETACH_Pos)) /* Assigment of value for DETACH in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_UPRSM_Pos _UINT16_(1) /* (USB_DEVICE_CTRLB) Upstream Resume Position */
#define USB_DEVICE_CTRLB_UPRSM_Msk                                                                                     \
        (_UINT16_(0x1) << USB_DEVICE_CTRLB_UPRSM_Pos) /* (USB_DEVICE_CTRLB) Upstream Resume Mask */
#define USB_DEVICE_CTRLB_UPRSM(value)                                                                                  \
        (USB_DEVICE_CTRLB_UPRSM_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_SPDCONF_Pos _UINT16_(2) /* (USB_DEVICE_CTRLB) Speed Configuration Position */
#define USB_DEVICE_CTRLB_SPDCONF_Msk                                                                                   \
        (_UINT16_(0x3) << USB_DEVICE_CTRLB_SPDCONF_Pos) /* (USB_DEVICE_CTRLB) Speed Configuration Mask */
#define USB_DEVICE_CTRLB_SPDCONF(value)                                                                                \
        (USB_DEVICE_CTRLB_SPDCONF_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_SPDCONF_Pos)) /* Assigment of value for SPDCONF in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_SPDCONF_FS_Val _UINT16_(0x0) /* (USB_DEVICE_CTRLB) FS : Full Speed  */
#define USB_DEVICE_CTRLB_SPDCONF_LS_Val _UINT16_(0x1) /* (USB_DEVICE_CTRLB) LS : Low Speed  */
#define USB_DEVICE_CTRLB_SPDCONF_HS_Val _UINT16_(0x2) /* (USB_DEVICE_CTRLB) HS : High Speed capable  */
#define USB_DEVICE_CTRLB_SPDCONF_HSTM_Val                                                                              \
        _UINT16_(0x3) /* (USB_DEVICE_CTRLB) HSTM: High Speed Test Mode (force high-speed mode for test mode)  */
#define USB_DEVICE_CTRLB_SPDCONF_FS                                                                                    \
        (                                                                                                              \
                USB_DEVICE_CTRLB_SPDCONF_FS_Val                                                                        \
                << USB_DEVICE_CTRLB_SPDCONF_Pos) /* (USB_DEVICE_CTRLB) FS : Full Speed Position  */
#define USB_DEVICE_CTRLB_SPDCONF_LS                                                                                    \
        (                                                                                                              \
                USB_DEVICE_CTRLB_SPDCONF_LS_Val                                                                        \
                << USB_DEVICE_CTRLB_SPDCONF_Pos) /* (USB_DEVICE_CTRLB) LS : Low Speed Position  */
#define USB_DEVICE_CTRLB_SPDCONF_HS                                                                                    \
        (                                                                                                              \
                USB_DEVICE_CTRLB_SPDCONF_HS_Val                                                                        \
                << USB_DEVICE_CTRLB_SPDCONF_Pos) /* (USB_DEVICE_CTRLB) HS : High Speed capable Position  */
#define USB_DEVICE_CTRLB_SPDCONF_HSTM                                                                                  \
        (USB_DEVICE_CTRLB_SPDCONF_HSTM_Val                                                                             \
         << USB_DEVICE_CTRLB_SPDCONF_Pos) /* (USB_DEVICE_CTRLB) HSTM: High Speed Test Mode (force high-speed mode for  \
                                             test mode) Position  */
#define USB_DEVICE_CTRLB_NREPLY_Pos _UINT16_(4) /* (USB_DEVICE_CTRLB) No Reply Position */
#define USB_DEVICE_CTRLB_NREPLY_Msk                                                                                    \
        (_UINT16_(0x1) << USB_DEVICE_CTRLB_NREPLY_Pos) /* (USB_DEVICE_CTRLB) No Reply Mask */
#define USB_DEVICE_CTRLB_NREPLY(value)                                                                                 \
        (USB_DEVICE_CTRLB_NREPLY_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_NREPLY_Pos)) /* Assigment of value for NREPLY in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_TSTJ_Pos _UINT16_(5) /* (USB_DEVICE_CTRLB) Test mode J Position */
#define USB_DEVICE_CTRLB_TSTJ_Msk (_UINT16_(0x1) << USB_DEVICE_CTRLB_TSTJ_Pos) /* (USB_DEVICE_CTRLB) Test mode J Mask  \
                                                                                */
#define USB_DEVICE_CTRLB_TSTJ(value)                                                                                   \
        (USB_DEVICE_CTRLB_TSTJ_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_TSTJ_Pos)) /* Assigment of value for TSTJ in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_TSTK_Pos _UINT16_(6) /* (USB_DEVICE_CTRLB) Test mode K Position */
#define USB_DEVICE_CTRLB_TSTK_Msk (_UINT16_(0x1) << USB_DEVICE_CTRLB_TSTK_Pos) /* (USB_DEVICE_CTRLB) Test mode K Mask  \
                                                                                */
#define USB_DEVICE_CTRLB_TSTK(value)                                                                                   \
        (USB_DEVICE_CTRLB_TSTK_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_TSTK_Pos)) /* Assigment of value for TSTK in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_TSTPCKT_Pos _UINT16_(7) /* (USB_DEVICE_CTRLB) Test packet mode Position */
#define USB_DEVICE_CTRLB_TSTPCKT_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_CTRLB_TSTPCKT_Pos) /* (USB_DEVICE_CTRLB) Test packet mode Mask */
#define USB_DEVICE_CTRLB_TSTPCKT(value)                                                                                \
        (USB_DEVICE_CTRLB_TSTPCKT_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_TSTPCKT_Pos)) /* Assigment of value for TSTPCKT in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_OPMODE2_Pos _UINT16_(8) /* (USB_DEVICE_CTRLB) Specific Operational Mode Position */
#define USB_DEVICE_CTRLB_OPMODE2_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_CTRLB_OPMODE2_Pos) /* (USB_DEVICE_CTRLB) Specific Operational Mode Mask */
#define USB_DEVICE_CTRLB_OPMODE2(value)                                                                                \
        (USB_DEVICE_CTRLB_OPMODE2_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_OPMODE2_Pos)) /* Assigment of value for OPMODE2 in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_GNAK_Pos _UINT16_(9) /* (USB_DEVICE_CTRLB) Global NAK Position */
#define USB_DEVICE_CTRLB_GNAK_Msk (_UINT16_(0x1) << USB_DEVICE_CTRLB_GNAK_Pos) /* (USB_DEVICE_CTRLB) Global NAK Mask   \
                                                                                */
#define USB_DEVICE_CTRLB_GNAK(value)                                                                                   \
        (USB_DEVICE_CTRLB_GNAK_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_GNAK_Pos)) /* Assigment of value for GNAK in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_LPMHDSK_Pos _UINT16_(10) /* (USB_DEVICE_CTRLB) Link Power Management Handshake Position */
#define USB_DEVICE_CTRLB_LPMHDSK_Msk                                                                                   \
        (_UINT16_(0x3) << USB_DEVICE_CTRLB_LPMHDSK_Pos) /* (USB_DEVICE_CTRLB) Link Power Management Handshake Mask */
#define USB_DEVICE_CTRLB_LPMHDSK(value)                                                                                \
        (USB_DEVICE_CTRLB_LPMHDSK_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_CTRLB_LPMHDSK_Pos)) /* Assigment of value for LPMHDSK in the USB_DEVICE_CTRLB register */
#define USB_DEVICE_CTRLB_LPMHDSK_NO_Val _UINT16_(0x0) /* (USB_DEVICE_CTRLB) No handshake. LPM is not supported  */
#define USB_DEVICE_CTRLB_LPMHDSK_ACK_Val _UINT16_(0x1) /* (USB_DEVICE_CTRLB) ACK  */
#define USB_DEVICE_CTRLB_LPMHDSK_NYET_Val _UINT16_(0x2) /* (USB_DEVICE_CTRLB) NYET  */
#define USB_DEVICE_CTRLB_LPMHDSK_STALL_Val _UINT16_(0x3) /* (USB_DEVICE_CTRLB) STALL  */
#define USB_DEVICE_CTRLB_LPMHDSK_NO                                                                                    \
        (                                                                                                              \
                USB_DEVICE_CTRLB_LPMHDSK_NO_Val                                                                        \
                << USB_DEVICE_CTRLB_LPMHDSK_Pos) /* (USB_DEVICE_CTRLB) No handshake. LPM is not supported Position  */
#define USB_DEVICE_CTRLB_LPMHDSK_ACK                                                                                   \
        (USB_DEVICE_CTRLB_LPMHDSK_ACK_Val << USB_DEVICE_CTRLB_LPMHDSK_Pos) /* (USB_DEVICE_CTRLB) ACK Position  */
#define USB_DEVICE_CTRLB_LPMHDSK_NYET                                                                                  \
        (USB_DEVICE_CTRLB_LPMHDSK_NYET_Val << USB_DEVICE_CTRLB_LPMHDSK_Pos) /* (USB_DEVICE_CTRLB) NYET Position  */
#define USB_DEVICE_CTRLB_LPMHDSK_STALL                                                                                 \
        (USB_DEVICE_CTRLB_LPMHDSK_STALL_Val << USB_DEVICE_CTRLB_LPMHDSK_Pos) /* (USB_DEVICE_CTRLB) STALL Position  */
#define USB_DEVICE_CTRLB_Msk _UINT16_(0x0FFF) /* (USB_DEVICE_CTRLB) Register Mask  */

