ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_DEVICE_CTRLB_OPMODE_Pos _UINT16_(8) /* (USB_DEVICE_CTRLB Position) Specific Operational Mode */
#define USB_DEVICE_CTRLB_OPMODE_Msk (_UINT16_(0x1) << USB_DEVICE_CTRLB_OPMODE_Pos) /* (USB_DEVICE_CTRLB Mask) OPMODE   \
                                                                                    */
#define USB_DEVICE_CTRLB_OPMODE(value) (USB_DEVICE_CTRLB_OPMODE_Msk & (_UINT16_(value) << USB_DEVICE_CTRLB_OPMODE_Pos))

/* -------- USB_HOST_CTRLB : (USB Offset: 0x08) (R/W 16) HOST Control B -------- */
#define USB_HOST_CTRLB_RESETVALUE _UINT16_(0x00) /*  (USB_HOST_CTRLB) HOST Control B  Reset Value */

#define USB_HOST_CTRLB_RESUME_Pos _UINT16_(1) /* (USB_HOST_CTRLB) Send USB Resume Position */
#define USB_HOST_CTRLB_RESUME_Msk                                                                                      \
        (_UINT16_(0x1) << USB_HOST_CTRLB_RESUME_Pos) /* (USB_HOST_CTRLB) Send USB Resume Mask */
#define USB_HOST_CTRLB_RESUME(value)                                                                                   \
        (USB_HOST_CTRLB_RESUME_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_RESUME_Pos)) /* Assigment of value for RESUME in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_SPDCONF_Pos _UINT16_(2) /* (USB_HOST_CTRLB) Speed Configuration for Host Position */
#define USB_HOST_CTRLB_SPDCONF_Msk                                                                                     \
        (_UINT16_(0x3) << USB_HOST_CTRLB_SPDCONF_Pos) /* (USB_HOST_CTRLB) Speed Configuration for Host Mask */
#define USB_HOST_CTRLB_SPDCONF(value)                                                                                  \
        (USB_HOST_CTRLB_SPDCONF_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_SPDCONF_Pos)) /* Assigment of value for SPDCONF in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_SPDCONF_NORMAL_Val                                                                              \
        _UINT16_(0x0) /* (USB_HOST_CTRLB) Normal mode:the host starts in full-speed mode and performs a high-speed     \
                         reset to switch to the high speed mode if the downstream peripheral is high-speed capable. */
#define USB_HOST_CTRLB_SPDCONF_FS_Val                                                                                  \
        _UINT16_(0x3) /* (USB_HOST_CTRLB) Full-speed:the host remains in full-speed mode whatever is the peripheral    \
                         speed capability. Relevant in UTMI mode only.  */
#define USB_HOST_CTRLB_SPDCONF_NORMAL                                                                                  \
        (USB_HOST_CTRLB_SPDCONF_NORMAL_Val                                                                             \
         << USB_HOST_CTRLB_SPDCONF_Pos) /* (USB_HOST_CTRLB) Normal mode:the host starts in full-speed mode and         \
                                           performs a high-speed reset to switch to the high speed mode if the         \
                                           downstream peripheral is high-speed capable. Position  */
#define USB_HOST_CTRLB_SPDCONF_FS                                                                                      \
        (USB_HOST_CTRLB_SPDCONF_FS_Val                                                                                 \
         << USB_HOST_CTRLB_SPDCONF_Pos) /* (USB_HOST_CTRLB) Full-speed:the host remains in full-speed mode whatever is \
                                           the peripheral speed capability. Relevant in UTMI mode only. Position  */
#define USB_HOST_CTRLB_TSTJ_Pos _UINT16_(5) /* (USB_HOST_CTRLB) Test mode J Position */
#define USB_HOST_CTRLB_TSTJ_Msk (_UINT16_(0x1) << USB_HOST_CTRLB_TSTJ_Pos) /* (USB_HOST_CTRLB) Test mode J Mask */
#define USB_HOST_CTRLB_TSTJ(value)                                                                                     \
        (USB_HOST_CTRLB_TSTJ_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_TSTJ_Pos)) /* Assigment of value for TSTJ in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_TSTK_Pos _UINT16_(6) /* (USB_HOST_CTRLB) Test mode K Position */
#define USB_HOST_CTRLB_TSTK_Msk (_UINT16_(0x1) << USB_HOST_CTRLB_TSTK_Pos) /* (USB_HOST_CTRLB) Test mode K Mask */
#define USB_HOST_CTRLB_TSTK(value)                                                                                     \
        (USB_HOST_CTRLB_TSTK_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_TSTK_Pos)) /* Assigment of value for TSTK in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_SOFE_Pos _UINT16_(8) /* (USB_HOST_CTRLB) Start of Frame Generation Enable Position */
#define USB_HOST_CTRLB_SOFE_Msk                                                                                        \
        (_UINT16_(0x1) << USB_HOST_CTRLB_SOFE_Pos) /* (USB_HOST_CTRLB) Start of Frame Generation Enable Mask */
#define USB_HOST_CTRLB_SOFE(value)                                                                                     \
        (USB_HOST_CTRLB_SOFE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_SOFE_Pos)) /* Assigment of value for SOFE in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_BUSRESET_Pos _UINT16_(9) /* (USB_HOST_CTRLB) Send USB Reset Position */
#define USB_HOST_CTRLB_BUSRESET_Msk                                                                                    \
        (_UINT16_(0x1) << USB_HOST_CTRLB_BUSRESET_Pos) /* (USB_HOST_CTRLB) Send USB Reset Mask */
#define USB_HOST_CTRLB_BUSRESET(value)                                                                                 \
        (USB_HOST_CTRLB_BUSRESET_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_BUSRESET_Pos)) /* Assigment of value for BUSRESET in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_VBUSOK_Pos _UINT16_(10) /* (USB_HOST_CTRLB) VBUS is OK Position */
#define USB_HOST_CTRLB_VBUSOK_Msk (_UINT16_(0x1) << USB_HOST_CTRLB_VBUSOK_Pos) /* (USB_HOST_CTRLB) VBUS is OK Mask */
#define USB_HOST_CTRLB_VBUSOK(value)                                                                                   \
        (USB_HOST_CTRLB_VBUSOK_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_VBUSOK_Pos)) /* Assigment of value for VBUSOK in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_L1RESUME_Pos _UINT16_(11) /* (USB_HOST_CTRLB) Send L1 Resume Position */
#define USB_HOST_CTRLB_L1RESUME_Msk                                                                                    \
        (_UINT16_(0x1) << USB_HOST_CTRLB_L1RESUME_Pos) /* (USB_HOST_CTRLB) Send L1 Resume Mask */
#define USB_HOST_CTRLB_L1RESUME(value)                                                                                 \
        (USB_HOST_CTRLB_L1RESUME_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_CTRLB_L1RESUME_Pos)) /* Assigment of value for L1RESUME in the USB_HOST_CTRLB register */
#define USB_HOST_CTRLB_Msk _UINT16_(0x0F6E) /* (USB_HOST_CTRLB) Register Mask  */


/* -------- USB_DEVICE_DADD : (USB Offset: 0x0A) (R/W 8) DEVICE Device Address -------- */
#define USB_DEVICE_DADD_RESETVALUE _UINT8_(0x00) /*  (USB_DEVICE_DADD) DEVICE Device Address  Reset Value */

#define USB_DEVICE_DADD_DADD_Pos _UINT8_(0) /* (USB_DEVICE_DADD) Device Address Position */
#define USB_DEVICE_DADD_DADD_Msk (_UINT8_(0x7F) << USB_DEVICE_DADD_DADD_Pos) /* (USB_DEVICE_DADD) Device Address Mask  \
                                                                              */
#define USB_DEVICE_DADD_DADD(value)                                                                                    \
        (USB_DEVICE_DADD_DADD_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << USB_DEVICE_DADD_DADD_Pos)) /* Assigment of value for DADD in the USB_DEVICE_DADD register */
#define USB_DEVICE_DADD_ADDEN_Pos _UINT8_(7) /* (USB_DEVICE_DADD) Device Address Enable Position */
#define USB_DEVICE_DADD_ADDEN_Msk                                                                                      \
        (_UINT8_(0x1) << USB_DEVICE_DADD_ADDEN_Pos) /* (USB_DEVICE_DADD) Device Address Enable Mask */
#define USB_DEVICE_DADD_ADDEN(value)                                                                                   \
        (USB_DEVICE_DADD_ADDEN_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << USB_DEVICE_DADD_ADDEN_Pos)) /* Assigment of value for ADDEN in the USB_DEVICE_DADD register */
#define USB_DEVICE_DADD_Msk _UINT8_(0xFF) /* (USB_DEVICE_DADD) Register Mask  */


/* -------- USB_HOST_HSOFC : (USB Offset: 0x0A) (R/W 8) HOST Host Start Of Frame Control -------- */
#define USB_HOST_HSOFC_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_HSOFC) HOST Host Start Of Frame Control  Reset Value */

#define USB_HOST_HSOFC_FLENC_Pos _UINT8_(0) /* (USB_HOST_HSOFC) Frame Length Control Position */
#define USB_HOST_HSOFC_FLENC_Msk                                                                                       \
        (_UINT8_(0xF) << USB_HOST_HSOFC_FLENC_Pos) /* (USB_HOST_HSOFC) Frame Length Control Mask */
#define USB_HOST_HSOFC_FLENC(value)                                                                                    \
        (USB_HOST_HSOFC_FLENC_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_HSOFC_FLENC_Pos)) /* Assigment of value for FLENC in the USB_HOST_HSOFC register */
#define USB_HOST_HSOFC_FLENCE_Pos _UINT8_(7) /* (USB_HOST_HSOFC) Frame Length Control Enable Position */
#define USB_HOST_HSOFC_FLENCE_Msk                                                                                      \
        (_UINT8_(0x1) << USB_HOST_HSOFC_FLENCE_Pos) /* (USB_HOST_HSOFC) Frame Length Control Enable Mask */
#define USB_HOST_HSOFC_FLENCE(value)                                                                                   \
        (USB_HOST_HSOFC_FLENCE_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_HSOFC_FLENCE_Pos)) /* Assigment of value for FLENCE in the USB_HOST_HSOFC register */
#define USB_HOST_HSOFC_Msk _UINT8_(0x8F) /* (USB_HOST_HSOFC) Register Mask  */


/* -------- USB_DEVICE_STATUS : (USB Offset: 0x0C) ( R/ 8) DEVICE Status -------- */
#define USB_DEVICE_STATUS_RESETVALUE _UINT8_(0x40) /*  (USB_DEVICE_STATUS) DEVICE Status  Reset Value */

#define USB_DEVICE_STATUS_SPEED_Pos _UINT8_(2) /* (USB_DEVICE_STATUS) Speed Status Position */
#define USB_DEVICE_STATUS_SPEED_Msk                                                                                    \
        (_UINT8_(0x3) << USB_DEVICE_STATUS_SPEED_Pos) /* (USB_DEVICE_STATUS) Speed Status Mask */
#define USB_DEVICE_STATUS_SPEED(value)                                                                                 \
        (USB_DEVICE_STATUS_SPEED_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << USB_DEVICE_STATUS_SPEED_Pos)) /* Assigment of value for SPEED in the USB_DEVICE_STATUS register */
#define USB_DEVICE_STATUS_SPEED_FS_Val _UINT8_(0x0) /* (USB_DEVICE_STATUS) Full-speed mode  */
#define USB_DEVICE_STATUS_SPEED_HS_Val _UINT8_(0x1) /* (USB_DEVICE_STATUS) High-speed mode  */
#define USB_DEVICE_STATUS_SPEED_LS_Val _UINT8_(0x2) /* (USB_DEVICE_STATUS) Low-speed mode  */
#define USB_DEVICE_STATUS_SPEED_FS                                                                                     \
        (                                                                                                              \
                USB_DEVICE_STATUS_SPEED_FS_Val                                                                         \
                << USB_DEVICE_STATUS_SPEED_Pos) /* (USB_DEVICE_STATUS) Full-speed mode Position  */
#define USB_DEVICE_STATUS_SPEED_HS                                                                                     \
        (                                                                                                              \
                USB_DEVICE_STATUS_SPEED_HS_Val                                                                         \
                << USB_DEVICE_STATUS_SPEED_Pos) /* (USB_DEVICE_STATUS) High-speed mode Position  */
#define USB_DEVICE_STATUS_SPEED_LS                                                                                     \
        (                                                                                                              \
                USB_DEVICE_STATUS_SPEED_LS_Val                                                                         \
                << USB_DEVICE_STATUS_SPEED_Pos) /* (USB_DEVICE_STATUS) Low-speed mode Position  */
#define USB_DEVICE_STATUS_LINESTATE_Pos _UINT8_(6) /* (USB_DEVICE_STATUS) USB Line State Status Position */
#define USB_DEVICE_STATUS_LINESTATE_Msk                                                                                \
        (_UINT8_(0x3) << USB_DEVICE_STATUS_LINESTATE_Pos) /* (USB_DEVICE_STATUS) USB Line State Status Mask */
#define USB_DEVICE_STATUS_LINESTATE(value)                                                                             \
        (USB_DEVICE_STATUS_LINESTATE_Msk &                                                                             \
         (_UINT8_(value) << USB_DEVICE_STATUS_LINESTATE_Pos)) /* Assigment of value for LINESTATE in the               \
                                                                 USB_DEVICE_STATUS register */
#define USB_DEVICE_STATUS_LINESTATE_0_Val _UINT8_(0x0) /* (USB_DEVICE_STATUS) SE0/RESET  */
#define USB_DEVICE_STATUS_LINESTATE_1_Val _UINT8_(0x1) /* (USB_DEVICE_STATUS) FS-J or LS-K State  */
#define USB_DEVICE_STATUS_LINESTATE_2_Val _UINT8_(0x2) /* (USB_DEVICE_STATUS) FS-K or LS-J State  */
#define USB_DEVICE_STATUS_LINESTATE_0                                                                                  \
        (USB_DEVICE_STATUS_LINESTATE_0_Val                                                                             \
         << USB_DEVICE_STATUS_LINESTATE_Pos) /* (USB_DEVICE_STATUS) SE0/RESET Position  */
#define USB_DEVICE_STATUS_LINESTATE_1                                                                                  \
        (USB_DEVICE_STATUS_LINESTATE_1_Val                                                                             \
         << USB_DEVICE_STATUS_LINESTATE_Pos) /* (USB_DEVICE_STATUS) FS-J or LS-K State Position  */
#define USB_DEVICE_STATUS_LINESTATE_2                                                                                  \
        (USB_DEVICE_STATUS_LINESTATE_2_Val                                                                             \
         << USB_DEVICE_STATUS_LINESTATE_Pos) /* (USB_DEVICE_STATUS) FS-K or LS-J State Position  */
#define USB_DEVICE_STATUS_Msk _UINT8_(0xCC) /* (USB_DEVICE_STATUS) Register Mask  */


/* -------- USB_HOST_STATUS : (USB Offset: 0x0C) (R/W 8) HOST Status -------- */
#define USB_HOST_STATUS_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_STATUS) HOST Status  Reset Value */

