ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_HOST_STATUS_SPEED_Pos _UINT8_(2) /* (USB_HOST_STATUS) Speed Status Position */
#define USB_HOST_STATUS_SPEED_Msk (_UINT8_(0x3) << USB_HOST_STATUS_SPEED_Pos) /* (USB_HOST_STATUS) Speed Status Mask   \
                                                                               */
#define USB_HOST_STATUS_SPEED(value)                                                                                   \
        (USB_HOST_STATUS_SPEED_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_STATUS_SPEED_Pos)) /* Assigment of value for SPEED in the USB_HOST_STATUS register */
#define USB_HOST_STATUS_LINESTATE_Pos _UINT8_(6) /* (USB_HOST_STATUS) USB Line State Status Position */
#define USB_HOST_STATUS_LINESTATE_Msk                                                                                  \
        (_UINT8_(0x3) << USB_HOST_STATUS_LINESTATE_Pos) /* (USB_HOST_STATUS) USB Line State Status Mask */
#define USB_HOST_STATUS_LINESTATE(value)                                                                               \
        (USB_HOST_STATUS_LINESTATE_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_STATUS_LINESTATE_Pos)) /* Assigment of value for LINESTATE in the USB_HOST_STATUS register */
#define USB_HOST_STATUS_Msk _UINT8_(0xCC) /* (USB_HOST_STATUS) Register Mask  */


/* -------- USB_FSMSTATUS : (USB Offset: 0x0D) ( R/ 8) Finite State Machine Status -------- */
#define USB_FSMSTATUS_RESETVALUE _UINT8_(0x01) /*  (USB_FSMSTATUS) Finite State Machine Status  Reset Value */

#define USB_FSMSTATUS_FSMSTATE_Pos _UINT8_(0) /* (USB_FSMSTATUS) Fine State Machine Status Position */
#define USB_FSMSTATUS_FSMSTATE_Msk                                                                                     \
        (_UINT8_(0x7F) << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) Fine State Machine Status Mask */
#define USB_FSMSTATUS_FSMSTATE(value)                                                                                  \
        (USB_FSMSTATUS_FSMSTATE_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << USB_FSMSTATUS_FSMSTATE_Pos)) /* Assigment of value for FSMSTATE in the USB_FSMSTATUS register */
#define USB_FSMSTATUS_FSMSTATE_OFF_Val                                                                                 \
        _UINT8_(0x1) /* (USB_FSMSTATUS) OFF (L3). It corresponds to the powered-off, disconnected, and disabled state  \
                      */
#define USB_FSMSTATUS_FSMSTATE_ON_Val                                                                                  \
        _UINT8_(0x2) /* (USB_FSMSTATUS) ON (L0). It corresponds to the Idle and Active states  */
#define USB_FSMSTATUS_FSMSTATE_SUSPEND_Val _UINT8_(0x4) /* (USB_FSMSTATUS) SUSPEND (L2)  */
#define USB_FSMSTATUS_FSMSTATE_SLEEP_Val _UINT8_(0x8) /* (USB_FSMSTATUS) SLEEP (L1)  */
#define USB_FSMSTATUS_FSMSTATE_DNRESUME_Val _UINT8_(0x10) /* (USB_FSMSTATUS) DNRESUME. Down Stream Resume.  */
#define USB_FSMSTATUS_FSMSTATE_UPRESUME_Val _UINT8_(0x20) /* (USB_FSMSTATUS) UPRESUME. Up Stream Resume.  */
#define USB_FSMSTATUS_FSMSTATE_RESET_Val _UINT8_(0x40) /* (USB_FSMSTATUS) RESET. USB lines Reset.  */
#define USB_FSMSTATUS_FSMSTATE_OFF                                                                                     \
        (                                                                                                              \
                USB_FSMSTATUS_FSMSTATE_OFF_Val                                                                         \
                << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) OFF (L3). It corresponds to the powered-off,         \
                                                  disconnected, and disabled state Position  */
#define USB_FSMSTATUS_FSMSTATE_ON                                                                                      \
        (USB_FSMSTATUS_FSMSTATE_ON_Val << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) ON (L0). It corresponds to    \
                                                                         the Idle and Active states Position  */
#define USB_FSMSTATUS_FSMSTATE_SUSPEND                                                                                 \
        (USB_FSMSTATUS_FSMSTATE_SUSPEND_Val << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) SUSPEND (L2) Position */
#define USB_FSMSTATUS_FSMSTATE_SLEEP                                                                                   \
        (USB_FSMSTATUS_FSMSTATE_SLEEP_Val << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) SLEEP (L1) Position  */
#define USB_FSMSTATUS_FSMSTATE_DNRESUME                                                                                \
        (USB_FSMSTATUS_FSMSTATE_DNRESUME_Val                                                                           \
         << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) DNRESUME. Down Stream Resume. Position  */
#define USB_FSMSTATUS_FSMSTATE_UPRESUME                                                                                \
        (USB_FSMSTATUS_FSMSTATE_UPRESUME_Val                                                                           \
         << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) UPRESUME. Up Stream Resume. Position  */
#define USB_FSMSTATUS_FSMSTATE_RESET                                                                                   \
        (USB_FSMSTATUS_FSMSTATE_RESET_Val                                                                              \
         << USB_FSMSTATUS_FSMSTATE_Pos) /* (USB_FSMSTATUS) RESET. USB lines Reset. Position  */
#define USB_FSMSTATUS_Msk _UINT8_(0x7F) /* (USB_FSMSTATUS) Register Mask  */


/* -------- USB_DEVICE_FNUM : (USB Offset: 0x10) ( R/ 16) DEVICE Device Frame Number -------- */
#define USB_DEVICE_FNUM_RESETVALUE _UINT16_(0x00) /*  (USB_DEVICE_FNUM) DEVICE Device Frame Number  Reset Value */

#define USB_DEVICE_FNUM_MFNUM_Pos _UINT16_(0) /* (USB_DEVICE_FNUM) Micro Frame Number Position */
#define USB_DEVICE_FNUM_MFNUM_Msk                                                                                      \
        (_UINT16_(0x7) << USB_DEVICE_FNUM_MFNUM_Pos) /* (USB_DEVICE_FNUM) Micro Frame Number Mask */
#define USB_DEVICE_FNUM_MFNUM(value)                                                                                   \
        (USB_DEVICE_FNUM_MFNUM_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_FNUM_MFNUM_Pos)) /* Assigment of value for MFNUM in the USB_DEVICE_FNUM register */
#define USB_DEVICE_FNUM_FNUM_Pos _UINT16_(3) /* (USB_DEVICE_FNUM) Frame Number Position */
#define USB_DEVICE_FNUM_FNUM_Msk (_UINT16_(0x7FF) << USB_DEVICE_FNUM_FNUM_Pos) /* (USB_DEVICE_FNUM) Frame Number Mask  \
                                                                                */
#define USB_DEVICE_FNUM_FNUM(value)                                                                                    \
        (USB_DEVICE_FNUM_FNUM_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_FNUM_FNUM_Pos)) /* Assigment of value for FNUM in the USB_DEVICE_FNUM register */
#define USB_DEVICE_FNUM_FNCERR_Pos _UINT16_(15) /* (USB_DEVICE_FNUM) Frame Number CRC Error Position */
#define USB_DEVICE_FNUM_FNCERR_Msk                                                                                     \
        (_UINT16_(0x1) << USB_DEVICE_FNUM_FNCERR_Pos) /* (USB_DEVICE_FNUM) Frame Number CRC Error Mask */
#define USB_DEVICE_FNUM_FNCERR(value)                                                                                  \
        (USB_DEVICE_FNUM_FNCERR_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_FNUM_FNCERR_Pos)) /* Assigment of value for FNCERR in the USB_DEVICE_FNUM register */
#define USB_DEVICE_FNUM_Msk _UINT16_(0xBFFF) /* (USB_DEVICE_FNUM) Register Mask  */


/* -------- USB_HOST_FNUM : (USB Offset: 0x10) (R/W 16) HOST Host Frame Number -------- */
#define USB_HOST_FNUM_RESETVALUE _UINT16_(0x00) /*  (USB_HOST_FNUM) HOST Host Frame Number  Reset Value */

#define USB_HOST_FNUM_MFNUM_Pos _UINT16_(0) /* (USB_HOST_FNUM) Micro Frame Number Position */
#define USB_HOST_FNUM_MFNUM_Msk (_UINT16_(0x7) << USB_HOST_FNUM_MFNUM_Pos) /* (USB_HOST_FNUM) Micro Frame Number Mask  \
                                                                            */
#define USB_HOST_FNUM_MFNUM(value)                                                                                     \
        (USB_HOST_FNUM_MFNUM_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_FNUM_MFNUM_Pos)) /* Assigment of value for MFNUM in the USB_HOST_FNUM register */
#define USB_HOST_FNUM_FNUM_Pos _UINT16_(3) /* (USB_HOST_FNUM) Frame Number Position */
#define USB_HOST_FNUM_FNUM_Msk (_UINT16_(0x7FF) << USB_HOST_FNUM_FNUM_Pos) /* (USB_HOST_FNUM) Frame Number Mask */
#define USB_HOST_FNUM_FNUM(value)                                                                                      \
        (USB_HOST_FNUM_FNUM_Msk &                                                                                      \
         (_UINT16_(value) << USB_HOST_FNUM_FNUM_Pos)) /* Assigment of value for FNUM in the USB_HOST_FNUM register */
#define USB_HOST_FNUM_Msk _UINT16_(0x3FFF) /* (USB_HOST_FNUM) Register Mask  */


