ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_HOST_FLENHIGH : (USB Offset: 0x12) ( R/ 8) HOST Host Frame Length -------- */
#define USB_HOST_FLENHIGH_RESETVALUE _UINT8_(0x00) /*  (USB_HOST_FLENHIGH) HOST Host Frame Length  Reset Value */

#define USB_HOST_FLENHIGH_FLENHIGH_Pos _UINT8_(0) /* (USB_HOST_FLENHIGH) Frame Length Position */
#define USB_HOST_FLENHIGH_FLENHIGH_Msk                                                                                 \
        (_UINT8_(0xFF) << USB_HOST_FLENHIGH_FLENHIGH_Pos) /* (USB_HOST_FLENHIGH) Frame Length Mask */
#define USB_HOST_FLENHIGH_FLENHIGH(value)                                                                              \
        (USB_HOST_FLENHIGH_FLENHIGH_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << USB_HOST_FLENHIGH_FLENHIGH_Pos)) /* Assigment of value for FLENHIGH in the USB_HOST_FLENHIGH register */
#define USB_HOST_FLENHIGH_Msk _UINT8_(0xFF) /* (USB_HOST_FLENHIGH) Register Mask  */


/* -------- USB_DEVICE_INTENCLR : (USB Offset: 0x14) (R/W 16) DEVICE Device Interrupt Enable Clear -------- */
#define USB_DEVICE_INTENCLR_RESETVALUE                                                                                 \
        _UINT16_(0x00) /*  (USB_DEVICE_INTENCLR) DEVICE Device Interrupt Enable Clear  Reset Value */

#define USB_DEVICE_INTENCLR_SUSPEND_Pos _UINT16_(0) /* (USB_DEVICE_INTENCLR) Suspend Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_SUSPEND_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_SUSPEND_Pos) /* (USB_DEVICE_INTENCLR) Suspend Interrupt Enable Mask */
#define USB_DEVICE_INTENCLR_SUSPEND(value)                                                                             \
        (USB_DEVICE_INTENCLR_SUSPEND_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENCLR_SUSPEND_Pos)) /* Assigment of value for SUSPEND in the                \
                                                                  USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_MSOF_Pos                                                                                   \
        _UINT16_(1) /* (USB_DEVICE_INTENCLR) Micro Start of Frame Interrupt Enable in High Speed Mode Position */
#define USB_DEVICE_INTENCLR_MSOF_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_MSOF_Pos) /* (USB_DEVICE_INTENCLR) Micro Start of Frame Interrupt Enable \
                                                           in High Speed Mode Mask */
#define USB_DEVICE_INTENCLR_MSOF(value)                                                                                \
        (USB_DEVICE_INTENCLR_MSOF_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_MSOF_Pos)) /* Assigment of value for MSOF in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_SOF_Pos _UINT16_(2) /* (USB_DEVICE_INTENCLR) Start Of Frame Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_SOF_Msk                                                                                    \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_SOF_Pos) /* (USB_DEVICE_INTENCLR) Start Of Frame Interrupt Enable Mask   \
                                                        */
#define USB_DEVICE_INTENCLR_SOF(value)                                                                                 \
        (USB_DEVICE_INTENCLR_SOF_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_SOF_Pos)) /* Assigment of value for SOF in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_EORST_Pos _UINT16_(3) /* (USB_DEVICE_INTENCLR) End of Reset Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_EORST_Msk                                                                                  \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_EORST_Pos) /* (USB_DEVICE_INTENCLR) End of Reset Interrupt Enable Mask   \
                                                          */
#define USB_DEVICE_INTENCLR_EORST(value)                                                                               \
        (USB_DEVICE_INTENCLR_EORST_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_EORST_Pos)) /* Assigment of value for EORST in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_WAKEUP_Pos _UINT16_(4) /* (USB_DEVICE_INTENCLR) Wake Up Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_WAKEUP_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_WAKEUP_Pos) /* (USB_DEVICE_INTENCLR) Wake Up Interrupt Enable Mask */
#define USB_DEVICE_INTENCLR_WAKEUP(value)                                                                              \
        (USB_DEVICE_INTENCLR_WAKEUP_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_EORSM_Pos _UINT16_(5) /* (USB_DEVICE_INTENCLR) End Of Resume Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_EORSM_Msk                                                                                  \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_EORSM_Pos) /* (USB_DEVICE_INTENCLR) End Of Resume Interrupt Enable Mask  \
                                                          */
#define USB_DEVICE_INTENCLR_EORSM(value)                                                                               \
        (USB_DEVICE_INTENCLR_EORSM_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_EORSM_Pos)) /* Assigment of value for EORSM in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_UPRSM_Pos _UINT16_(6) /* (USB_DEVICE_INTENCLR) Upstream Resume Interrupt Enable Position   \
                                                   */
#define USB_DEVICE_INTENCLR_UPRSM_Msk                                                                                  \
        (_UINT16_(0x1)                                                                                                 \
         << USB_DEVICE_INTENCLR_UPRSM_Pos) /* (USB_DEVICE_INTENCLR) Upstream Resume Interrupt Enable Mask */
#define USB_DEVICE_INTENCLR_UPRSM(value)                                                                               \
        (USB_DEVICE_INTENCLR_UPRSM_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENCLR_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_RAMACER_Pos _UINT16_(7) /* (USB_DEVICE_INTENCLR) Ram Access Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_RAMACER_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_RAMACER_Pos) /* (USB_DEVICE_INTENCLR) Ram Access Interrupt Enable Mask   \
                                                            */
#define USB_DEVICE_INTENCLR_RAMACER(value)                                                                             \
        (USB_DEVICE_INTENCLR_RAMACER_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENCLR_RAMACER_Pos)) /* Assigment of value for RAMACER in the                \
                                                                  USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_LPMNYET_Pos                                                                                \
        _UINT16_(8) /* (USB_DEVICE_INTENCLR) Link Power Management Not Yet Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_LPMNYET_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_LPMNYET_Pos) /* (USB_DEVICE_INTENCLR) Link Power Management Not Yet      \
                                                              Interrupt Enable Mask */
#define USB_DEVICE_INTENCLR_LPMNYET(value)                                                                             \
        (USB_DEVICE_INTENCLR_LPMNYET_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENCLR_LPMNYET_Pos)) /* Assigment of value for LPMNYET in the                \
                                                                  USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_LPMSUSP_Pos                                                                                \
        _UINT16_(9) /* (USB_DEVICE_INTENCLR) Link Power Management Suspend Interrupt Enable Position */
#define USB_DEVICE_INTENCLR_LPMSUSP_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENCLR_LPMSUSP_Pos) /* (USB_DEVICE_INTENCLR) Link Power Management Suspend      \
                                                              Interrupt Enable Mask */
#define USB_DEVICE_INTENCLR_LPMSUSP(value)                                                                             \
        (USB_DEVICE_INTENCLR_LPMSUSP_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENCLR_LPMSUSP_Pos)) /* Assigment of value for LPMSUSP in the                \
                                                                  USB_DEVICE_INTENCLR register */
#define USB_DEVICE_INTENCLR_Msk _UINT16_(0x03FF) /* (USB_DEVICE_INTENCLR) Register Mask  */


/* -------- USB_HOST_INTENCLR : (USB Offset: 0x14) (R/W 16) HOST Host Interrupt Enable Clear -------- */
#define USB_HOST_INTENCLR_RESETVALUE                                                                                   \
        _UINT16_(0x00) /*  (USB_HOST_INTENCLR) HOST Host Interrupt Enable Clear  Reset Value */

#define USB_HOST_INTENCLR_HSOF_Pos _UINT16_(2) /* (USB_HOST_INTENCLR) Host Start Of Frame Interrupt Disable Position   \
                                                */
#define USB_HOST_INTENCLR_HSOF_Msk                                                                                     \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENCLR_HSOF_Pos) /* (USB_HOST_INTENCLR) Host Start Of Frame Interrupt Disable Mask */
#define USB_HOST_INTENCLR_HSOF(value)                                                                                  \
        (USB_HOST_INTENCLR_HSOF_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_HSOF_Pos)) /* Assigment of value for HSOF in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_RST_Pos _UINT16_(3) /* (USB_HOST_INTENCLR) BUS Reset Interrupt Disable Position */
#define USB_HOST_INTENCLR_RST_Msk                                                                                      \
        (_UINT16_(0x1) << USB_HOST_INTENCLR_RST_Pos) /* (USB_HOST_INTENCLR) BUS Reset Interrupt Disable Mask */
#define USB_HOST_INTENCLR_RST(value)                                                                                   \
        (USB_HOST_INTENCLR_RST_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_RST_Pos)) /* Assigment of value for RST in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_WAKEUP_Pos _UINT16_(4) /* (USB_HOST_INTENCLR) Wake Up Interrupt Disable Position */
#define USB_HOST_INTENCLR_WAKEUP_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_INTENCLR_WAKEUP_Pos) /* (USB_HOST_INTENCLR) Wake Up Interrupt Disable Mask */
#define USB_HOST_INTENCLR_WAKEUP(value)                                                                                \
        (USB_HOST_INTENCLR_WAKEUP_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_DNRSM_Pos                                                                                    \
        _UINT16_(5) /* (USB_HOST_INTENCLR) DownStream to Device Interrupt Disable Position */
#define USB_HOST_INTENCLR_DNRSM_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENCLR_DNRSM_Pos) /* (USB_HOST_INTENCLR) DownStream to Device Interrupt Disable Mask */
#define USB_HOST_INTENCLR_DNRSM(value)                                                                                 \
        (USB_HOST_INTENCLR_DNRSM_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_DNRSM_Pos)) /* Assigment of value for DNRSM in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_UPRSM_Pos                                                                                    \
        _UINT16_(6) /* (USB_HOST_INTENCLR) Upstream Resume from Device Interrupt Disable Position */
#define USB_HOST_INTENCLR_UPRSM_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENCLR_UPRSM_Pos) /* (USB_HOST_INTENCLR) Upstream Resume from Device Interrupt Disable Mask */
#define USB_HOST_INTENCLR_UPRSM(value)                                                                                 \
        (USB_HOST_INTENCLR_UPRSM_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_RAMACER_Pos _UINT16_(7) /* (USB_HOST_INTENCLR) Ram Access Interrupt Disable Position */
#define USB_HOST_INTENCLR_RAMACER_Msk                                                                                  \
        (_UINT16_(0x1) << USB_HOST_INTENCLR_RAMACER_Pos) /* (USB_HOST_INTENCLR) Ram Access Interrupt Disable Mask */
#define USB_HOST_INTENCLR_RAMACER(value)                                                                               \
        (USB_HOST_INTENCLR_RAMACER_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_RAMACER_Pos)) /* Assigment of value for RAMACER in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_DCONN_Pos _UINT16_(8) /* (USB_HOST_INTENCLR) Device Connection Interrupt Disable Position */
#define USB_HOST_INTENCLR_DCONN_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENCLR_DCONN_Pos) /* (USB_HOST_INTENCLR) Device Connection Interrupt Disable Mask */
#define USB_HOST_INTENCLR_DCONN(value)                                                                                 \
        (USB_HOST_INTENCLR_DCONN_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_DCONN_Pos)) /* Assigment of value for DCONN in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_DDISC_Pos                                                                                    \
        _UINT16_(9) /* (USB_HOST_INTENCLR) Device Disconnection Interrupt Disable Position */
#define USB_HOST_INTENCLR_DDISC_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENCLR_DDISC_Pos) /* (USB_HOST_INTENCLR) Device Disconnection Interrupt Disable Mask */
#define USB_HOST_INTENCLR_DDISC(value)                                                                                 \
        (USB_HOST_INTENCLR_DDISC_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENCLR_DDISC_Pos)) /* Assigment of value for DDISC in the USB_HOST_INTENCLR register */
#define USB_HOST_INTENCLR_Msk _UINT16_(0x03FC) /* (USB_HOST_INTENCLR) Register Mask  */


