ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_DEVICE_INTENSET : (USB Offset: 0x18) (R/W 16) DEVICE Device Interrupt Enable Set -------- */
#define USB_DEVICE_INTENSET_RESETVALUE                                                                                 \
        _UINT16_(0x00) /*  (USB_DEVICE_INTENSET) DEVICE Device Interrupt Enable Set  Reset Value */

#define USB_DEVICE_INTENSET_SUSPEND_Pos _UINT16_(0) /* (USB_DEVICE_INTENSET) Suspend Interrupt Enable Position */
#define USB_DEVICE_INTENSET_SUSPEND_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_SUSPEND_Pos) /* (USB_DEVICE_INTENSET) Suspend Interrupt Enable Mask */
#define USB_DEVICE_INTENSET_SUSPEND(value)                                                                             \
        (USB_DEVICE_INTENSET_SUSPEND_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENSET_SUSPEND_Pos)) /* Assigment of value for SUSPEND in the                \
                                                                  USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_MSOF_Pos                                                                                   \
        _UINT16_(1) /* (USB_DEVICE_INTENSET) Micro Start of Frame Interrupt Enable in High Speed Mode Position */
#define USB_DEVICE_INTENSET_MSOF_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_MSOF_Pos) /* (USB_DEVICE_INTENSET) Micro Start of Frame Interrupt Enable \
                                                           in High Speed Mode Mask */
#define USB_DEVICE_INTENSET_MSOF(value)                                                                                \
        (USB_DEVICE_INTENSET_MSOF_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_MSOF_Pos)) /* Assigment of value for MSOF in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_SOF_Pos _UINT16_(2) /* (USB_DEVICE_INTENSET) Start Of Frame Interrupt Enable Position */
#define USB_DEVICE_INTENSET_SOF_Msk                                                                                    \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_SOF_Pos) /* (USB_DEVICE_INTENSET) Start Of Frame Interrupt Enable Mask   \
                                                        */
#define USB_DEVICE_INTENSET_SOF(value)                                                                                 \
        (USB_DEVICE_INTENSET_SOF_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_SOF_Pos)) /* Assigment of value for SOF in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_EORST_Pos _UINT16_(3) /* (USB_DEVICE_INTENSET) End of Reset Interrupt Enable Position */
#define USB_DEVICE_INTENSET_EORST_Msk                                                                                  \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_EORST_Pos) /* (USB_DEVICE_INTENSET) End of Reset Interrupt Enable Mask   \
                                                          */
#define USB_DEVICE_INTENSET_EORST(value)                                                                               \
        (USB_DEVICE_INTENSET_EORST_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_EORST_Pos)) /* Assigment of value for EORST in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_WAKEUP_Pos _UINT16_(4) /* (USB_DEVICE_INTENSET) Wake Up Interrupt Enable Position */
#define USB_DEVICE_INTENSET_WAKEUP_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_WAKEUP_Pos) /* (USB_DEVICE_INTENSET) Wake Up Interrupt Enable Mask */
#define USB_DEVICE_INTENSET_WAKEUP(value)                                                                              \
        (USB_DEVICE_INTENSET_WAKEUP_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_EORSM_Pos _UINT16_(5) /* (USB_DEVICE_INTENSET) End Of Resume Interrupt Enable Position */
#define USB_DEVICE_INTENSET_EORSM_Msk                                                                                  \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_EORSM_Pos) /* (USB_DEVICE_INTENSET) End Of Resume Interrupt Enable Mask  \
                                                          */
#define USB_DEVICE_INTENSET_EORSM(value)                                                                               \
        (USB_DEVICE_INTENSET_EORSM_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_EORSM_Pos)) /* Assigment of value for EORSM in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_UPRSM_Pos _UINT16_(6) /* (USB_DEVICE_INTENSET) Upstream Resume Interrupt Enable Position   \
                                                   */
#define USB_DEVICE_INTENSET_UPRSM_Msk                                                                                  \
        (_UINT16_(0x1)                                                                                                 \
         << USB_DEVICE_INTENSET_UPRSM_Pos) /* (USB_DEVICE_INTENSET) Upstream Resume Interrupt Enable Mask */
#define USB_DEVICE_INTENSET_UPRSM(value)                                                                               \
        (USB_DEVICE_INTENSET_UPRSM_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTENSET_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_RAMACER_Pos _UINT16_(7) /* (USB_DEVICE_INTENSET) Ram Access Interrupt Enable Position */
#define USB_DEVICE_INTENSET_RAMACER_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_RAMACER_Pos) /* (USB_DEVICE_INTENSET) Ram Access Interrupt Enable Mask   \
                                                            */
#define USB_DEVICE_INTENSET_RAMACER(value)                                                                             \
        (USB_DEVICE_INTENSET_RAMACER_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENSET_RAMACER_Pos)) /* Assigment of value for RAMACER in the                \
                                                                  USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_LPMNYET_Pos                                                                                \
        _UINT16_(8) /* (USB_DEVICE_INTENSET) Link Power Management Not Yet Interrupt Enable Position */
#define USB_DEVICE_INTENSET_LPMNYET_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_LPMNYET_Pos) /* (USB_DEVICE_INTENSET) Link Power Management Not Yet      \
                                                              Interrupt Enable Mask */
#define USB_DEVICE_INTENSET_LPMNYET(value)                                                                             \
        (USB_DEVICE_INTENSET_LPMNYET_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENSET_LPMNYET_Pos)) /* Assigment of value for LPMNYET in the                \
                                                                  USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_LPMSUSP_Pos                                                                                \
        _UINT16_(9) /* (USB_DEVICE_INTENSET) Link Power Management Suspend Interrupt Enable Position */
#define USB_DEVICE_INTENSET_LPMSUSP_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_INTENSET_LPMSUSP_Pos) /* (USB_DEVICE_INTENSET) Link Power Management Suspend      \
                                                              Interrupt Enable Mask */
#define USB_DEVICE_INTENSET_LPMSUSP(value)                                                                             \
        (USB_DEVICE_INTENSET_LPMSUSP_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_INTENSET_LPMSUSP_Pos)) /* Assigment of value for LPMSUSP in the                \
                                                                  USB_DEVICE_INTENSET register */
#define USB_DEVICE_INTENSET_Msk _UINT16_(0x03FF) /* (USB_DEVICE_INTENSET) Register Mask  */


/* -------- USB_HOST_INTENSET : (USB Offset: 0x18) (R/W 16) HOST Host Interrupt Enable Set -------- */
#define USB_HOST_INTENSET_RESETVALUE                                                                                   \
        _UINT16_(0x00) /*  (USB_HOST_INTENSET) HOST Host Interrupt Enable Set  Reset Value */

#define USB_HOST_INTENSET_HSOF_Pos _UINT16_(2) /* (USB_HOST_INTENSET) Host Start Of Frame Interrupt Enable Position */
#define USB_HOST_INTENSET_HSOF_Msk                                                                                     \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENSET_HSOF_Pos) /* (USB_HOST_INTENSET) Host Start Of Frame Interrupt Enable Mask */
#define USB_HOST_INTENSET_HSOF(value)                                                                                  \
        (USB_HOST_INTENSET_HSOF_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_HSOF_Pos)) /* Assigment of value for HSOF in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_RST_Pos _UINT16_(3) /* (USB_HOST_INTENSET) Bus Reset Interrupt Enable Position */
#define USB_HOST_INTENSET_RST_Msk                                                                                      \
        (_UINT16_(0x1) << USB_HOST_INTENSET_RST_Pos) /* (USB_HOST_INTENSET) Bus Reset Interrupt Enable Mask */
#define USB_HOST_INTENSET_RST(value)                                                                                   \
        (USB_HOST_INTENSET_RST_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_RST_Pos)) /* Assigment of value for RST in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_WAKEUP_Pos _UINT16_(4) /* (USB_HOST_INTENSET) Wake Up Interrupt Enable Position */
#define USB_HOST_INTENSET_WAKEUP_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_INTENSET_WAKEUP_Pos) /* (USB_HOST_INTENSET) Wake Up Interrupt Enable Mask */
#define USB_HOST_INTENSET_WAKEUP(value)                                                                                \
        (USB_HOST_INTENSET_WAKEUP_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_DNRSM_Pos                                                                                    \
        _UINT16_(5) /* (USB_HOST_INTENSET) DownStream to the Device Interrupt Enable Position */
#define USB_HOST_INTENSET_DNRSM_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENSET_DNRSM_Pos) /* (USB_HOST_INTENSET) DownStream to the Device Interrupt Enable Mask */
#define USB_HOST_INTENSET_DNRSM(value)                                                                                 \
        (USB_HOST_INTENSET_DNRSM_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_DNRSM_Pos)) /* Assigment of value for DNRSM in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_UPRSM_Pos                                                                                    \
        _UINT16_(6) /* (USB_HOST_INTENSET) Upstream Resume fromthe device Interrupt Enable Position */
#define USB_HOST_INTENSET_UPRSM_Msk                                                                                    \
        (_UINT16_(0x1) << USB_HOST_INTENSET_UPRSM_Pos) /* (USB_HOST_INTENSET) Upstream Resume fromthe device Interrupt \
                                                          Enable Mask */
#define USB_HOST_INTENSET_UPRSM(value)                                                                                 \
        (USB_HOST_INTENSET_UPRSM_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_RAMACER_Pos _UINT16_(7) /* (USB_HOST_INTENSET) Ram Access Interrupt Enable Position */
#define USB_HOST_INTENSET_RAMACER_Msk                                                                                  \
        (_UINT16_(0x1) << USB_HOST_INTENSET_RAMACER_Pos) /* (USB_HOST_INTENSET) Ram Access Interrupt Enable Mask */
#define USB_HOST_INTENSET_RAMACER(value)                                                                               \
        (USB_HOST_INTENSET_RAMACER_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_RAMACER_Pos)) /* Assigment of value for RAMACER in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_DCONN_Pos                                                                                    \
        _UINT16_(8) /* (USB_HOST_INTENSET) Link Power Management Interrupt Enable Position */
#define USB_HOST_INTENSET_DCONN_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENSET_DCONN_Pos) /* (USB_HOST_INTENSET) Link Power Management Interrupt Enable Mask */
#define USB_HOST_INTENSET_DCONN(value)                                                                                 \
        (USB_HOST_INTENSET_DCONN_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_DCONN_Pos)) /* Assigment of value for DCONN in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_DDISC_Pos _UINT16_(9) /* (USB_HOST_INTENSET) Device Disconnection Interrupt Enable Position  \
                                                 */
#define USB_HOST_INTENSET_DDISC_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_HOST_INTENSET_DDISC_Pos) /* (USB_HOST_INTENSET) Device Disconnection Interrupt Enable Mask */
#define USB_HOST_INTENSET_DDISC(value)                                                                                 \
        (USB_HOST_INTENSET_DDISC_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTENSET_DDISC_Pos)) /* Assigment of value for DDISC in the USB_HOST_INTENSET register */
#define USB_HOST_INTENSET_Msk _UINT16_(0x03FC) /* (USB_HOST_INTENSET) Register Mask  */


/* -------- USB_DEVICE_INTFLAG : (USB Offset: 0x1C) (R/W 16) DEVICE Device Interrupt Flag -------- */
#define USB_DEVICE_INTFLAG_RESETVALUE                                                                                  \
        _UINT16_(0x00) /*  (USB_DEVICE_INTFLAG) DEVICE Device Interrupt Flag  Reset Value */

