ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#define USB_DEVICE_INTFLAG_SUSPEND_Pos _UINT16_(0) /* (USB_DEVICE_INTFLAG) Suspend Position */
#define USB_DEVICE_INTFLAG_SUSPEND_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_SUSPEND_Pos) /* (USB_DEVICE_INTFLAG) Suspend Mask */
#define USB_DEVICE_INTFLAG_SUSPEND(value)                                                                              \
        (USB_DEVICE_INTFLAG_SUSPEND_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_SUSPEND_Pos)) /* Assigment of value for SUSPEND in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_MSOF_Pos                                                                                    \
        _UINT16_(1) /* (USB_DEVICE_INTFLAG) Micro Start of Frame in High Speed Mode Position */
#define USB_DEVICE_INTFLAG_MSOF_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << USB_DEVICE_INTFLAG_MSOF_Pos) /* (USB_DEVICE_INTFLAG) Micro Start of Frame in High Speed Mode Mask */
#define USB_DEVICE_INTFLAG_MSOF(value)                                                                                 \
        (USB_DEVICE_INTFLAG_MSOF_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_MSOF_Pos)) /* Assigment of value for MSOF in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_SOF_Pos _UINT16_(2) /* (USB_DEVICE_INTFLAG) Start Of Frame Position */
#define USB_DEVICE_INTFLAG_SOF_Msk                                                                                     \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_SOF_Pos) /* (USB_DEVICE_INTFLAG) Start Of Frame Mask */
#define USB_DEVICE_INTFLAG_SOF(value)                                                                                  \
        (USB_DEVICE_INTFLAG_SOF_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_SOF_Pos)) /* Assigment of value for SOF in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_EORST_Pos _UINT16_(3) /* (USB_DEVICE_INTFLAG) End of Reset Position */
#define USB_DEVICE_INTFLAG_EORST_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_EORST_Pos) /* (USB_DEVICE_INTFLAG) End of Reset Mask */
#define USB_DEVICE_INTFLAG_EORST(value)                                                                                \
        (USB_DEVICE_INTFLAG_EORST_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_EORST_Pos)) /* Assigment of value for EORST in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_WAKEUP_Pos _UINT16_(4) /* (USB_DEVICE_INTFLAG) Wake Up Position */
#define USB_DEVICE_INTFLAG_WAKEUP_Msk                                                                                  \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_WAKEUP_Pos) /* (USB_DEVICE_INTFLAG) Wake Up Mask */
#define USB_DEVICE_INTFLAG_WAKEUP(value)                                                                               \
        (USB_DEVICE_INTFLAG_WAKEUP_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_EORSM_Pos _UINT16_(5) /* (USB_DEVICE_INTFLAG) End Of Resume Position */
#define USB_DEVICE_INTFLAG_EORSM_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_EORSM_Pos) /* (USB_DEVICE_INTFLAG) End Of Resume Mask */
#define USB_DEVICE_INTFLAG_EORSM(value)                                                                                \
        (USB_DEVICE_INTFLAG_EORSM_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_EORSM_Pos)) /* Assigment of value for EORSM in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_UPRSM_Pos _UINT16_(6) /* (USB_DEVICE_INTFLAG) Upstream Resume Position */
#define USB_DEVICE_INTFLAG_UPRSM_Msk                                                                                   \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_UPRSM_Pos) /* (USB_DEVICE_INTFLAG) Upstream Resume Mask */
#define USB_DEVICE_INTFLAG_UPRSM(value)                                                                                \
        (USB_DEVICE_INTFLAG_UPRSM_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_RAMACER_Pos _UINT16_(7) /* (USB_DEVICE_INTFLAG) Ram Access Position */
#define USB_DEVICE_INTFLAG_RAMACER_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_RAMACER_Pos) /* (USB_DEVICE_INTFLAG) Ram Access Mask */
#define USB_DEVICE_INTFLAG_RAMACER(value)                                                                              \
        (USB_DEVICE_INTFLAG_RAMACER_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_RAMACER_Pos)) /* Assigment of value for RAMACER in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_LPMNYET_Pos _UINT16_(8) /* (USB_DEVICE_INTFLAG) Link Power Management Not Yet Position */
#define USB_DEVICE_INTFLAG_LPMNYET_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_LPMNYET_Pos) /* (USB_DEVICE_INTFLAG) Link Power Management Not Yet Mask   \
                                                           */
#define USB_DEVICE_INTFLAG_LPMNYET(value)                                                                              \
        (USB_DEVICE_INTFLAG_LPMNYET_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_LPMNYET_Pos)) /* Assigment of value for LPMNYET in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_LPMSUSP_Pos _UINT16_(9) /* (USB_DEVICE_INTFLAG) Link Power Management Suspend Position */
#define USB_DEVICE_INTFLAG_LPMSUSP_Msk                                                                                 \
        (_UINT16_(0x1) << USB_DEVICE_INTFLAG_LPMSUSP_Pos) /* (USB_DEVICE_INTFLAG) Link Power Management Suspend Mask   \
                                                           */
#define USB_DEVICE_INTFLAG_LPMSUSP(value)                                                                              \
        (USB_DEVICE_INTFLAG_LPMSUSP_Msk &                                                                              \
         (_UINT16_(value)                                                                                              \
          << USB_DEVICE_INTFLAG_LPMSUSP_Pos)) /* Assigment of value for LPMSUSP in the USB_DEVICE_INTFLAG register */
#define USB_DEVICE_INTFLAG_Msk _UINT16_(0x03FF) /* (USB_DEVICE_INTFLAG) Register Mask  */


/* -------- USB_HOST_INTFLAG : (USB Offset: 0x1C) (R/W 16) HOST Host Interrupt Flag -------- */
#define USB_HOST_INTFLAG_RESETVALUE _UINT16_(0x00) /*  (USB_HOST_INTFLAG) HOST Host Interrupt Flag  Reset Value */

#define USB_HOST_INTFLAG_HSOF_Pos _UINT16_(2) /* (USB_HOST_INTFLAG) Host Start Of Frame Position */
#define USB_HOST_INTFLAG_HSOF_Msk                                                                                      \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_HSOF_Pos) /* (USB_HOST_INTFLAG) Host Start Of Frame Mask */
#define USB_HOST_INTFLAG_HSOF(value)                                                                                   \
        (USB_HOST_INTFLAG_HSOF_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_HSOF_Pos)) /* Assigment of value for HSOF in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_RST_Pos _UINT16_(3) /* (USB_HOST_INTFLAG) Bus Reset Position */
#define USB_HOST_INTFLAG_RST_Msk (_UINT16_(0x1) << USB_HOST_INTFLAG_RST_Pos) /* (USB_HOST_INTFLAG) Bus Reset Mask */
#define USB_HOST_INTFLAG_RST(value)                                                                                    \
        (USB_HOST_INTFLAG_RST_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_RST_Pos)) /* Assigment of value for RST in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_WAKEUP_Pos _UINT16_(4) /* (USB_HOST_INTFLAG) Wake Up Position */
#define USB_HOST_INTFLAG_WAKEUP_Msk (_UINT16_(0x1) << USB_HOST_INTFLAG_WAKEUP_Pos) /* (USB_HOST_INTFLAG) Wake Up Mask  \
                                                                                    */
#define USB_HOST_INTFLAG_WAKEUP(value)                                                                                 \
        (USB_HOST_INTFLAG_WAKEUP_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_DNRSM_Pos _UINT16_(5) /* (USB_HOST_INTFLAG) Downstream Position */
#define USB_HOST_INTFLAG_DNRSM_Msk                                                                                     \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_DNRSM_Pos) /* (USB_HOST_INTFLAG) Downstream Mask */
#define USB_HOST_INTFLAG_DNRSM(value)                                                                                  \
        (USB_HOST_INTFLAG_DNRSM_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_DNRSM_Pos)) /* Assigment of value for DNRSM in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_UPRSM_Pos _UINT16_(6) /* (USB_HOST_INTFLAG) Upstream Resume from the Device Position */
#define USB_HOST_INTFLAG_UPRSM_Msk                                                                                     \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_UPRSM_Pos) /* (USB_HOST_INTFLAG) Upstream Resume from the Device Mask */
#define USB_HOST_INTFLAG_UPRSM(value)                                                                                  \
        (USB_HOST_INTFLAG_UPRSM_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_UPRSM_Pos)) /* Assigment of value for UPRSM in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_RAMACER_Pos _UINT16_(7) /* (USB_HOST_INTFLAG) Ram Access Position */
#define USB_HOST_INTFLAG_RAMACER_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_RAMACER_Pos) /* (USB_HOST_INTFLAG) Ram Access Mask */
#define USB_HOST_INTFLAG_RAMACER(value)                                                                                \
        (USB_HOST_INTFLAG_RAMACER_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_RAMACER_Pos)) /* Assigment of value for RAMACER in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_DCONN_Pos _UINT16_(8) /* (USB_HOST_INTFLAG) Device Connection Position */
#define USB_HOST_INTFLAG_DCONN_Msk                                                                                     \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_DCONN_Pos) /* (USB_HOST_INTFLAG) Device Connection Mask */
#define USB_HOST_INTFLAG_DCONN(value)                                                                                  \
        (USB_HOST_INTFLAG_DCONN_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_DCONN_Pos)) /* Assigment of value for DCONN in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_DDISC_Pos _UINT16_(9) /* (USB_HOST_INTFLAG) Device Disconnection Position */
#define USB_HOST_INTFLAG_DDISC_Msk                                                                                     \
        (_UINT16_(0x1) << USB_HOST_INTFLAG_DDISC_Pos) /* (USB_HOST_INTFLAG) Device Disconnection Mask */
#define USB_HOST_INTFLAG_DDISC(value)                                                                                  \
        (USB_HOST_INTFLAG_DDISC_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_INTFLAG_DDISC_Pos)) /* Assigment of value for DDISC in the USB_HOST_INTFLAG register */
#define USB_HOST_INTFLAG_Msk _UINT16_(0x03FC) /* (USB_HOST_INTFLAG) Register Mask  */


