ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
/* -------- USB_DEVICE_EPINTSMRY : (USB Offset: 0x20) ( R/ 16) DEVICE End Point Interrupt Summary -------- */
#define USB_DEVICE_EPINTSMRY_RESETVALUE                                                                                \
        _UINT16_(0x00) /*  (USB_DEVICE_EPINTSMRY) DEVICE End Point Interrupt Summary  Reset Value */

#define USB_DEVICE_EPINTSMRY_EPINT0_Pos _UINT16_(0) /* (USB_DEVICE_EPINTSMRY) End Point 0 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT0_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT0_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 0 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT0(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT0_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT0_Pos)) /* Assigment of value for EPINT0 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT1_Pos _UINT16_(1) /* (USB_DEVICE_EPINTSMRY) End Point 1 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT1_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT1_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 1 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT1(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT1_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT1_Pos)) /* Assigment of value for EPINT1 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT2_Pos _UINT16_(2) /* (USB_DEVICE_EPINTSMRY) End Point 2 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT2_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT2_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 2 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT2(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT2_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT2_Pos)) /* Assigment of value for EPINT2 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT3_Pos _UINT16_(3) /* (USB_DEVICE_EPINTSMRY) End Point 3 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT3_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT3_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 3 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT3(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT3_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT3_Pos)) /* Assigment of value for EPINT3 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT4_Pos _UINT16_(4) /* (USB_DEVICE_EPINTSMRY) End Point 4 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT4_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT4_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 4 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT4(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT4_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT4_Pos)) /* Assigment of value for EPINT4 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT5_Pos _UINT16_(5) /* (USB_DEVICE_EPINTSMRY) End Point 5 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT5_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT5_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 5 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT5(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT5_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT5_Pos)) /* Assigment of value for EPINT5 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT6_Pos _UINT16_(6) /* (USB_DEVICE_EPINTSMRY) End Point 6 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT6_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT6_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 6 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT6(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT6_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT6_Pos)) /* Assigment of value for EPINT6 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_EPINT7_Pos _UINT16_(7) /* (USB_DEVICE_EPINTSMRY) End Point 7 Interrupt Position */
#define USB_DEVICE_EPINTSMRY_EPINT7_Msk                                                                                \
        (_UINT16_(0x1) << USB_DEVICE_EPINTSMRY_EPINT7_Pos) /* (USB_DEVICE_EPINTSMRY) End Point 7 Interrupt Mask */
#define USB_DEVICE_EPINTSMRY_EPINT7(value)                                                                             \
        (USB_DEVICE_EPINTSMRY_EPINT7_Msk &                                                                             \
         (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT7_Pos)) /* Assigment of value for EPINT7 in the                 \
                                                                  USB_DEVICE_EPINTSMRY register */
#define USB_DEVICE_EPINTSMRY_Msk _UINT16_(0x00FF) /* (USB_DEVICE_EPINTSMRY) Register Mask  */

#define USB_DEVICE_EPINTSMRY_EPINT_Pos _UINT16_(0) /* (USB_DEVICE_EPINTSMRY Position) End Point 7 Interrupt */
#define USB_DEVICE_EPINTSMRY_EPINT_Msk                                                                                 \
        (_UINT16_(0xFF) << USB_DEVICE_EPINTSMRY_EPINT_Pos) /* (USB_DEVICE_EPINTSMRY Mask) EPINT */
#define USB_DEVICE_EPINTSMRY_EPINT(value)                                                                              \
        (USB_DEVICE_EPINTSMRY_EPINT_Msk & (_UINT16_(value) << USB_DEVICE_EPINTSMRY_EPINT_Pos))

/* -------- USB_HOST_PINTSMRY : (USB Offset: 0x20) ( R/ 16) HOST Pipe Interrupt Summary -------- */
#define USB_HOST_PINTSMRY_RESETVALUE _UINT16_(0x00) /*  (USB_HOST_PINTSMRY) HOST Pipe Interrupt Summary  Reset Value   \
                                                     */

#define USB_HOST_PINTSMRY_EPINT0_Pos _UINT16_(0) /* (USB_HOST_PINTSMRY) Pipe 0 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT0_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT0_Pos) /* (USB_HOST_PINTSMRY) Pipe 0 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT0(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT0_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT0_Pos)) /* Assigment of value for EPINT0 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT1_Pos _UINT16_(1) /* (USB_HOST_PINTSMRY) Pipe 1 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT1_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT1_Pos) /* (USB_HOST_PINTSMRY) Pipe 1 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT1(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT1_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT1_Pos)) /* Assigment of value for EPINT1 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT2_Pos _UINT16_(2) /* (USB_HOST_PINTSMRY) Pipe 2 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT2_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT2_Pos) /* (USB_HOST_PINTSMRY) Pipe 2 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT2(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT2_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT2_Pos)) /* Assigment of value for EPINT2 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT3_Pos _UINT16_(3) /* (USB_HOST_PINTSMRY) Pipe 3 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT3_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT3_Pos) /* (USB_HOST_PINTSMRY) Pipe 3 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT3(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT3_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT3_Pos)) /* Assigment of value for EPINT3 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT4_Pos _UINT16_(4) /* (USB_HOST_PINTSMRY) Pipe 4 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT4_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT4_Pos) /* (USB_HOST_PINTSMRY) Pipe 4 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT4(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT4_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT4_Pos)) /* Assigment of value for EPINT4 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT5_Pos _UINT16_(5) /* (USB_HOST_PINTSMRY) Pipe 5 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT5_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT5_Pos) /* (USB_HOST_PINTSMRY) Pipe 5 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT5(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT5_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT5_Pos)) /* Assigment of value for EPINT5 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT6_Pos _UINT16_(6) /* (USB_HOST_PINTSMRY) Pipe 6 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT6_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT6_Pos) /* (USB_HOST_PINTSMRY) Pipe 6 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT6(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT6_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT6_Pos)) /* Assigment of value for EPINT6 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_EPINT7_Pos _UINT16_(7) /* (USB_HOST_PINTSMRY) Pipe 7 Interrupt Position */
#define USB_HOST_PINTSMRY_EPINT7_Msk                                                                                   \
        (_UINT16_(0x1) << USB_HOST_PINTSMRY_EPINT7_Pos) /* (USB_HOST_PINTSMRY) Pipe 7 Interrupt Mask */
#define USB_HOST_PINTSMRY_EPINT7(value)                                                                                \
        (USB_HOST_PINTSMRY_EPINT7_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << USB_HOST_PINTSMRY_EPINT7_Pos)) /* Assigment of value for EPINT7 in the USB_HOST_PINTSMRY register */
#define USB_HOST_PINTSMRY_Msk _UINT16_(0x00FF) /* (USB_HOST_PINTSMRY) Register Mask  */

