ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/usb.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DEVICE_DESC_BANK register API structure */
typedef struct {
        __IO uint32_t USB_ADDR; /**< Offset: 0x00 (R/W  32) DEVICE_DESC_BANK Endpoint Bank, Adress of Data Buffer */
        __IO uint32_t USB_PCKSIZE; /**< Offset: 0x04 (R/W  32) DEVICE_DESC_BANK Endpoint Bank, Packet Size */
        __IO uint16_t USB_EXTREG; /**< Offset: 0x08 (R/W  16) DEVICE_DESC_BANK Endpoint Bank, Extended */
        __IO uint8_t USB_STATUS_BK; /**< Offset: 0x0A (R/W  8) DEVICE_DESC_BANK Enpoint Bank, Status of Bank */
        __I uint8_t Reserved1[0x05];
} usb_device_desc_bank_registers_t;

/** \brief HOST_DESC_BANK register API structure */
typedef struct {
        __IO uint32_t USB_ADDR; /**< Offset: 0x00 (R/W  32) HOST_DESC_BANK Host Bank, Adress of Data Buffer */
        __IO uint32_t USB_PCKSIZE; /**< Offset: 0x04 (R/W  32) HOST_DESC_BANK Host Bank, Packet Size */
        __IO uint16_t USB_EXTREG; /**< Offset: 0x08 (R/W  16) HOST_DESC_BANK Host Bank, Extended */
        __IO uint8_t USB_STATUS_BK; /**< Offset: 0x0A (R/W  8) HOST_DESC_BANK Host Bank, Status of Bank */
        __I uint8_t Reserved1[0x01];
        __IO uint16_t USB_CTRL_PIPE; /**< Offset: 0x0C (R/W  16) HOST_DESC_BANK Host Bank, Host Control Pipe */
        __IO uint16_t USB_STATUS_PIPE; /**< Offset: 0x0E (R/W  16) HOST_DESC_BANK Host Bank, Host Status Pipe */
} usb_host_desc_bank_registers_t;

/** \brief DEVICE_ENDPOINT register API structure */
typedef struct {
        __IO uint8_t USB_EPCFG; /**< Offset: 0x00 (R/W  8) DEVICE_ENDPOINT End Point Configuration */
        __I uint8_t Reserved1[0x03];
        __O uint8_t USB_EPSTATUSCLR; /**< Offset: 0x04 ( /W  8) DEVICE_ENDPOINT End Point Pipe Status Clear */
        __O uint8_t USB_EPSTATUSSET; /**< Offset: 0x05 ( /W  8) DEVICE_ENDPOINT End Point Pipe Status Set */
        __I uint8_t USB_EPSTATUS; /**< Offset: 0x06 (R/   8) DEVICE_ENDPOINT End Point Pipe Status */
        __IO uint8_t USB_EPINTFLAG; /**< Offset: 0x07 (R/W  8) DEVICE_ENDPOINT End Point Interrupt Flag */
        __IO uint8_t USB_EPINTENCLR; /**< Offset: 0x08 (R/W  8) DEVICE_ENDPOINT End Point Interrupt Clear Flag */
        __IO uint8_t USB_EPINTENSET; /**< Offset: 0x09 (R/W  8) DEVICE_ENDPOINT End Point Interrupt Set Flag */
        __I uint8_t Reserved2[0x16];
} usb_device_endpoint_registers_t;

/** \brief HOST_PIPE register API structure */
typedef struct {
        __IO uint8_t USB_PCFG; /**< Offset: 0x00 (R/W  8) HOST_PIPE End Point Configuration */
        __I uint8_t Reserved1[0x02];
        __IO uint8_t USB_BINTERVAL; /**< Offset: 0x03 (R/W  8) HOST_PIPE Bus Access Period of Pipe */
        __O uint8_t USB_PSTATUSCLR; /**< Offset: 0x04 ( /W  8) HOST_PIPE End Point Pipe Status Clear */
        __O uint8_t USB_PSTATUSSET; /**< Offset: 0x05 ( /W  8) HOST_PIPE End Point Pipe Status Set */
        __I uint8_t USB_PSTATUS; /**< Offset: 0x06 (R/   8) HOST_PIPE End Point Pipe Status */
        __IO uint8_t USB_PINTFLAG; /**< Offset: 0x07 (R/W  8) HOST_PIPE Pipe Interrupt Flag */
        __IO uint8_t USB_PINTENCLR; /**< Offset: 0x08 (R/W  8) HOST_PIPE Pipe Interrupt Flag Clear */
        __IO uint8_t USB_PINTENSET; /**< Offset: 0x09 (R/W  8) HOST_PIPE Pipe Interrupt Flag Set */
        __I uint8_t Reserved2[0x16];
} usb_host_pipe_registers_t;

#define USB_DEVICE_DESC_BANK_NUMBER 2

/** \brief USB_DESCRIPTOR register API structure */
typedef struct { /* Universal Serial Bus */
        usb_device_desc_bank_registers_t DEVICE_DESC_BANK[USB_DEVICE_DESC_BANK_NUMBER]; /**< Offset: 0x00  */
} usb_descriptor_device_registers_t;

#define USB_HOST_DESC_BANK_NUMBER 2

/** \brief USB_DESCRIPTOR register API structure */
typedef struct { /* Universal Serial Bus */
        usb_host_desc_bank_registers_t HOST_DESC_BANK[USB_HOST_DESC_BANK_NUMBER]; /**< Offset: 0x00  */
} usb_descriptor_host_registers_t;

/** \brief USB_DESCRIPTOR hardware registers */
typedef union { /* Universal Serial Bus */
        usb_descriptor_device_registers_t DEVICE; /**< USB is Device */
        usb_descriptor_host_registers_t HOST; /**< USB is Host */
} usb_descriptor_registers_t;

#define USB_DEVICE_ENDPOINT_NUMBER 8

/** \brief USB register API structure */
typedef struct { /* Universal Serial Bus */
        __IO uint8_t USB_CTRLA; /**< Offset: 0x00 (R/W  8) Control A */
        __I uint8_t Reserved1[0x01];
        __I uint8_t USB_SYNCBUSY; /**< Offset: 0x02 (R/   8) Synchronization Busy */
        __IO uint8_t USB_QOSCTRL; /**< Offset: 0x03 (R/W  8) USB Quality Of Service */
        __I uint8_t Reserved2[0x04];
        __IO uint16_t USB_CTRLB; /**< Offset: 0x08 (R/W  16) DEVICE Control B */
        __IO uint8_t USB_DADD; /**< Offset: 0x0A (R/W  8) DEVICE Device Address */
        __I uint8_t Reserved3[0x01];
        __I uint8_t USB_STATUS; /**< Offset: 0x0C (R/   8) DEVICE Status */
        __I uint8_t USB_FSMSTATUS; /**< Offset: 0x0D (R/   8) Finite State Machine Status */
        __I uint8_t Reserved4[0x02];
        __I uint16_t USB_FNUM; /**< Offset: 0x10 (R/   16) DEVICE Device Frame Number */
        __I uint8_t Reserved5[0x02];
        __IO uint16_t USB_INTENCLR; /**< Offset: 0x14 (R/W  16) DEVICE Device Interrupt Enable Clear */
        __I uint8_t Reserved6[0x02];
        __IO uint16_t USB_INTENSET; /**< Offset: 0x18 (R/W  16) DEVICE Device Interrupt Enable Set */
        __I uint8_t Reserved7[0x02];
        __IO uint16_t USB_INTFLAG; /**< Offset: 0x1C (R/W  16) DEVICE Device Interrupt Flag */
        __I uint8_t Reserved8[0x02];
        __I uint16_t USB_EPINTSMRY; /**< Offset: 0x20 (R/   16) DEVICE End Point Interrupt Summary */
        __I uint8_t Reserved9[0x02];
        __IO uint32_t USB_DESCADD; /**< Offset: 0x24 (R/W  32) Descriptor Address */
        __IO uint16_t USB_PADCAL; /**< Offset: 0x28 (R/W  16) USB PAD Calibration */
        __I uint8_t Reserved10[0xD6];
        usb_device_endpoint_registers_t DEVICE_ENDPOINT[USB_DEVICE_ENDPOINT_NUMBER]; /**< Offset: 0x100  */
} usb_device_registers_t;

#define USB_HOST_PIPE_NUMBER 8

/** \brief USB register API structure */
typedef struct { /* Universal Serial Bus */
        __IO uint8_t USB_CTRLA; /**< Offset: 0x00 (R/W  8) Control A */
        __I uint8_t Reserved1[0x01];
        __I uint8_t USB_SYNCBUSY; /**< Offset: 0x02 (R/   8) Synchronization Busy */
        __IO uint8_t USB_QOSCTRL; /**< Offset: 0x03 (R/W  8) USB Quality Of Service */
        __I uint8_t Reserved2[0x04];
        __IO uint16_t USB_CTRLB; /**< Offset: 0x08 (R/W  16) HOST Control B */
        __IO uint8_t USB_HSOFC; /**< Offset: 0x0A (R/W  8) HOST Host Start Of Frame Control */
        __I uint8_t Reserved3[0x01];
        __IO uint8_t USB_STATUS; /**< Offset: 0x0C (R/W  8) HOST Status */
        __I uint8_t USB_FSMSTATUS; /**< Offset: 0x0D (R/   8) Finite State Machine Status */
        __I uint8_t Reserved4[0x02];
        __IO uint16_t USB_FNUM; /**< Offset: 0x10 (R/W  16) HOST Host Frame Number */
        __I uint8_t USB_FLENHIGH; /**< Offset: 0x12 (R/   8) HOST Host Frame Length */
        __I uint8_t Reserved5[0x01];
        __IO uint16_t USB_INTENCLR; /**< Offset: 0x14 (R/W  16) HOST Host Interrupt Enable Clear */
        __I uint8_t Reserved6[0x02];
        __IO uint16_t USB_INTENSET; /**< Offset: 0x18 (R/W  16) HOST Host Interrupt Enable Set */
        __I uint8_t Reserved7[0x02];
        __IO uint16_t USB_INTFLAG; /**< Offset: 0x1C (R/W  16) HOST Host Interrupt Flag */
        __I uint8_t Reserved8[0x02];
        __I uint16_t USB_PINTSMRY; /**< Offset: 0x20 (R/   16) HOST Pipe Interrupt Summary */
        __I uint8_t Reserved9[0x02];
        __IO uint32_t USB_DESCADD; /**< Offset: 0x24 (R/W  32) Descriptor Address */
        __IO uint16_t USB_PADCAL; /**< Offset: 0x28 (R/W  16) USB PAD Calibration */
        __I uint8_t Reserved10[0xD6];
        usb_host_pipe_registers_t HOST_PIPE[USB_HOST_PIPE_NUMBER]; /**< Offset: 0x100  */
} usb_host_registers_t;

/** \brief USB hardware registers */
typedef union { /* Universal Serial Bus */
        usb_device_registers_t DEVICE; /**< USB is Device */
        usb_host_registers_t HOST; /**< USB is Host */
} usb_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \brief USB_DESCRIPTOR memory section attribute */
#define SECTION_USB_DESCRIPTOR

#endif /* _SAMD21_USB_COMPONENT_H_ */
